iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res7[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD8_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD8_WORD2;

  uint8_t res8[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD9_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD9_WORD2;

  uint8_t res9[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD2;

  uint8_t res10[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD2;

  uint8_t res11[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B16_19DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B20_23DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD6;

  uint8_t res12[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B16_19DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B20_23DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD13_WORD6;

  uint8_t res13[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD14_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD14_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD14_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD14_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B16_19DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD14_WORD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B20_23DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD14_WORD6;

  uint8_t res14[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD15_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD15_WORD2;

  uint8_t res15[504];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD17_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD17_WORD2;

  uint8_t res16[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD18_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD18_WORD2;

  uint8_t res17[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD19_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD19_WORD2;

  uint8_t res18[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD20_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD20_WORD2;

  uint8_t res19[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD21_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD21_WORD2;

  uint8_t res20[504];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD23_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD23_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD23_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD23_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B16_19DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD23_WORD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B20_23DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD23_WORD6;

  uint8_t res21[744];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD26_WORD1;

