iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res22[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD27_WORD1;

  uint8_t res23[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD28_WORD1;

  uint8_t res24[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD29_WORD1;

  uint8_t res25[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD30_WORD1;

  uint8_t res26[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD31_WORD1;

};

#define EIM_1 (*(volatile struct EIM_1_tag *) 0x40008000)

struct ERM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t ENCIE5:1;
      uint64_t ESCIE5:1;
      uint64_t reservedSpace1:2;
      uint64_t ENCIE4:1;
      uint64_t ESCIE4:1;
      uint64_t reservedSpace2:2;
      uint64_t ENCIE3:1;
      uint64_t ESCIE3:1;
      uint64_t reservedSpace3:2;
      uint64_t ENCIE2:1;
      uint64_t ESCIE2:1;
      uint64_t reservedSpace4:6;
      uint64_t ENCIE0:1;
      uint64_t ESCIE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t ENCIE12:1;
      uint64_t ESCIE12:1;
      uint64_t reservedSpace1:2;
      uint64_t ENCIE11:1;
      uint64_t ESCIE11:1;
      uint64_t reservedSpace2:2;
      uint64_t ENCIE10:1;
      uint64_t ESCIE10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:26;
      uint64_t ENCIE17:1;
      uint64_t ESCIE17:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t NCE5:1;
      uint64_t SBC5:1;
      uint64_t reservedSpace1:2;
      uint64_t NCE4:1;
      uint64_t SBC4:1;
      uint64_t reservedSpace2:2;
      uint64_t NCE3:1;
      uint64_t SBC3:1;
      uint64_t reservedSpace3:2;
      uint64_t NCE2:1;
      uint64_t SBC2:1;
      uint64_t reservedSpace4:6;
      uint64_t NCE0:1;
      uint64_t SBC0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t NCE12:1;
      uint64_t SBC12:1;
      uint64_t reservedSpace1:2;
      uint64_t NCE11:1;
      uint64_t SBC11:1;
      uint64_t reservedSpace2:2;
      uint64_t NCE10:1;
      uint64_t SBC10:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:26;
      uint64_t NCE17:1;
      uint64_t SBC17:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR2;

  uint8_t res1[228];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT0;

  uint8_t res2[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT2;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT3;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT4;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT5;

  uint8_t res6[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT10;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT11;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT12;

  uint8_t res9[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR17;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT17;

