iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define ERM_1 (*(volatile struct ERM_1_tag *) 0x4000c000)

struct TRGMUX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC12_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC12_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADC12_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPCMP_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPCMP_1_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPCMP_2_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BCTU_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS012_ODIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) eMIOS1_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FlexIO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIUL_OUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIUL_OUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIUL_OUT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SIUL_OUT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPI2C_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPSPI_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPSPI_1_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPSPI_2_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART_0_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART_1_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART_2_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:24;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LPUART_3_register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_SYNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_FORCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:16;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_SYNC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_FORCE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:1;
      uint64_t SEL3:7;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCU1_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL0:7;
      uint64_t reservedSpace0:1;
      uint64_t SEL1:7;
      uint64_t reservedSpace1:1;
      uint64_t SEL2:7;
      uint64_t reservedSpace2:8;
      uint64_t LK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM7_RXEV;

