iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define ADC_1 (*(volatile struct ADC_1_tag *) 0x400a4000)

struct ADC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWDN:1;
      uint64_t ADCLKSEL:2;
      uint64_t reservedSpace0:2;
      uint64_t ACKO:1;
      uint64_t ABORT:1;
      uint64_t ABORTCHAIN:1;
      uint64_t reservedSpace1:1;
      uint64_t AVGS:2;
      uint64_t AVGEN:1;
      uint64_t reservedSpace2:3;
      uint64_t STCL:1;
      uint64_t BCTU_MODE:1;
      uint64_t BCTUEN:1;
      uint64_t reservedSpace3:2;
      uint64_t JSTART:1;
      uint64_t JEDGE:1;
      uint64_t JTRGEN:1;
      uint64_t reservedSpace4:1;
      uint64_t NSTART:1;
      uint64_t XSTRTEN:1;
      uint64_t EDGE:1;
      uint64_t TRGEN:1;
      uint64_t reservedSpace5:1;
      uint64_t MODE:1;
      uint64_t WLSIDE:1;
      uint64_t OWREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCSTATUS:3;
      uint64_t reservedSpace0:2;
      uint64_t ACKO:1;
      uint64_t reservedSpace1:3;
      uint64_t CHADDR:7;
      uint64_t BCTUSTART:1;
      uint64_t reservedSpace2:1;
      uint64_t SELF_TEST_S:1;
      uint64_t reservedSpace3:1;
      uint64_t JSTART:1;
      uint64_t reservedSpace4:2;
      uint64_t JABORT:1;
      uint64_t NSTART:1;
      uint64_t reservedSpace5:6;
      uint64_t CALIBRTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECH:1;
      uint64_t EOC:1;
      uint64_t JECH:1;
      uint64_t JEOC:1;
      uint64_t EOBCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIEOCF0:1;
      uint64_t PIEOCF1:1;
      uint64_t PIEOCF2:1;
      uint64_t PIEOCF3:1;
      uint64_t PIEOCF4:1;
      uint64_t PIEOCF5:1;
      uint64_t PIEOCF6:1;
      uint64_t PIEOCF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEOCFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIEOCF0:1;
      uint64_t SIEOCF1:1;
      uint64_t SIEOCF2:1;
      uint64_t SIEOCF3:1;
      uint64_t SIEOCF4:1;
      uint64_t SIEOCF5:1;
      uint64_t SIEOCF6:1;
      uint64_t SIEOCF7:1;
      uint64_t SIEOCF8:1;
      uint64_t SIEOCF9:1;
      uint64_t SIEOCF10:1;
      uint64_t SIEOCF11:1;
      uint64_t SIEOCF12:1;
      uint64_t SIEOCF13:1;
      uint64_t SIEOCF14:1;
      uint64_t SIEOCF15:1;
      uint64_t SIEOCF16:1;
      uint64_t SIEOCF17:1;
      uint64_t SIEOCF18:1;
      uint64_t SIEOCF19:1;
      uint64_t SIEOCF20:1;
      uint64_t SIEOCF21:1;
      uint64_t SIEOCF22:1;
      uint64_t SIEOCF23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CEOCFR1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSKECH:1;
      uint64_t MSKEOC:1;
      uint64_t MSKJECH:1;
      uint64_t MSKJEOC:1;
      uint64_t MSKEOBCTU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIEOCIEN0:1;
      uint64_t PIEOCIEN1:1;
      uint64_t PIEOCIEN2:1;
      uint64_t PIEOCIEN3:1;
      uint64_t PIEOCIEN4:1;
      uint64_t PIEOCIEN5:1;
      uint64_t PIEOCIEN6:1;
      uint64_t PIEOCIEN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIMR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIEOCIEN0:1;
      uint64_t SIEOCIEN1:1;
      uint64_t SIEOCIEN2:1;
      uint64_t SIEOCIEN3:1;
      uint64_t SIEOCIEN4:1;
      uint64_t SIEOCIEN5:1;
      uint64_t SIEOCIEN6:1;
      uint64_t SIEOCIEN7:1;
      uint64_t SIEOCIEN8:1;
      uint64_t SIEOCIEN9:1;
      uint64_t SIEOCIEN10:1;
      uint64_t SIEOCIEN11:1;
      uint64_t SIEOCIEN12:1;
      uint64_t SIEOCIEN13:1;
      uint64_t SIEOCIEN14:1;
      uint64_t SIEOCIEN15:1;
      uint64_t SIEOCIEN16:1;
      uint64_t SIEOCIEN17:1;
      uint64_t SIEOCIEN18:1;
      uint64_t SIEOCIEN19:1;
      uint64_t SIEOCIEN20:1;
      uint64_t SIEOCIEN21:1;
      uint64_t SIEOCIEN22:1;
      uint64_t SIEOCIEN23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIMR1;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAWIF1:1;
      uint64_t HAWIF1:1;
      uint64_t LAWIF2:1;
      uint64_t HAWIF2:1;
      uint64_t LAWIF3:1;
      uint64_t HAWIF3:1;
      uint64_t LAWIF4:1;
      uint64_t HAWIF4:1;
      uint64_t LAWIF5:1;
      uint64_t HAWIF5:1;
      uint64_t LAWIF6:1;
      uint64_t HAWIF6:1;
      uint64_t LAWIF7:1;
      uint64_t HAWIF7:1;
      uint64_t LAWIF8:1;
      uint64_t HAWIF8:1;
      uint64_t LAWIF9:1;
      uint64_t HAWIF9:1;
      uint64_t LAWIF10:1;
      uint64_t HAWIF10:1;
      uint64_t LAWIF11:1;
      uint64_t HAWIF11:1;
      uint64_t LAWIF12:1;
      uint64_t HAWIF12:1;
      uint64_t LAWIF13:1;
      uint64_t HAWIF13:1;
      uint64_t LAWIF14:1;
      uint64_t HAWIF14:1;
      uint64_t LAWIF15:1;
      uint64_t HAWIF15:1;
      uint64_t LAWIF16:1;
      uint64_t HAWIF16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LAWIFEN1:1;
      uint64_t HDWIFEN1:1;
      uint64_t LAWIFEN2:1;
      uint64_t HDWIFEN2:1;
      uint64_t LAWIFEN3:1;
      uint64_t HDWIFEN3:1;
      uint64_t LAWIFEN4:1;
      uint64_t HDWIFEN4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTIMR;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t DCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PIDMAREN0:1;
      uint64_t PIDMAREN1:1;
      uint64_t PIDMAREN2:1;
      uint64_t PIDMAREN3:1;
      uint64_t PIDMAREN4:1;
      uint64_t PIDMAREN5:1;
      uint64_t PIDMAREN6:1;
      uint64_t PIDMAREN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIDMAREN0:1;
      uint64_t SIDMAREN1:1;
      uint64_t SIDMAREN2:1;
      uint64_t SIDMAREN3:1;
      uint64_t SIDMAREN4:1;
      uint64_t SIDMAREN5:1;
      uint64_t SIDMAREN6:1;
      uint64_t SIDMAREN7:1;
      uint64_t SIDMAREN8:1;
      uint64_t SIDMAREN9:1;
      uint64_t SIDMAREN10:1;
      uint64_t SIDMAREN11:1;
      uint64_t SIDMAREN12:1;
      uint64_t SIDMAREN13:1;
      uint64_t SIDMAREN14:1;
      uint64_t SIDMAREN15:1;
      uint64_t SIDMAREN16:1;
      uint64_t SIDMAREN17:1;
      uint64_t SIDMAREN18:1;
      uint64_t SIDMAREN19:1;
      uint64_t SIDMAREN20:1;
      uint64_t SIDMAREN21:1;
      uint64_t SIDMAREN22:1;
      uint64_t SIDMAREN23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAR1;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t THRL:15;
      uint64_t reservedSpace0:1;
      uint64_t THRH:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) THRHLR_3;

