iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define ADC_2 (*(volatile struct ADC_2_tag *) 0x400a8000)

struct PIT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ:1;
      uint64_t MDIS:1;
      uint64_t MDIS_RTI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[220];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTMR64H;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTMR64L;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RT_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_LDVAL_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTI_TFLG;

};

#define PIT_0 (*(volatile struct PIT_0_tag *) 0x400b0000)

struct PIT_0_TIMER_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_0_TIMER_0 (*(volatile struct PIT_0_TIMER_0_tag *) 0x400b0100)

struct PIT_0_TIMER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_0_TIMER_1 (*(volatile struct PIT_0_TIMER_1_tag *) 0x400b0110)

struct PIT_0_TIMER_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_0_TIMER_2 (*(volatile struct PIT_0_TIMER_2_tag *) 0x400b0120)

struct PIT_0_TIMER_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_0_TIMER_3 (*(volatile struct PIT_0_TIMER_3_tag *) 0x400b0130)

struct PIT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

};

#define PIT_1 (*(volatile struct PIT_1_tag *) 0x400b4000)

struct PIT_1_TIMER_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_1_TIMER_0 (*(volatile struct PIT_1_TIMER_0_tag *) 0x400b4100)

struct PIT_1_TIMER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_1_TIMER_1 (*(volatile struct PIT_1_TIMER_1_tag *) 0x400b4110)

struct PIT_1_TIMER_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

