iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define PIT_1_TIMER_2 (*(volatile struct PIT_1_TIMER_2_tag *) 0x400b4120)

struct PIT_1_TIMER_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_1_TIMER_3 (*(volatile struct PIT_1_TIMER_3_tag *) 0x400b4130)

struct PIT_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

};

#define PIT_2 (*(volatile struct PIT_2_tag *) 0x402fc000)

struct PIT_2_TIMER_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_2_TIMER_0 (*(volatile struct PIT_2_TIMER_0_tag *) 0x402fc100)

struct PIT_2_TIMER_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_2_TIMER_1 (*(volatile struct PIT_2_TIMER_1_tag *) 0x402fc110)

struct PIT_2_TIMER_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_2_TIMER_2 (*(volatile struct PIT_2_TIMER_2_tag *) 0x402fc120)

struct PIT_2_TIMER_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TVL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t TIE:1;
      uint64_t CHN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFLG;

};

#define PIT_2_TIMER_3 (*(volatile struct PIT_2_TIMER_3_tag *) 0x402fc130)

struct MU_2__MUA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_NUM:8;
      uint64_t RR_NUM:8;
      uint64_t GIR_NUM:8;
      uint64_t FLAG_WIDTH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUR:1;
      uint64_t MURIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MURS:1;
      uint64_t MURIP:1;
      uint64_t EP:1;
      uint64_t FUP:1;
      uint64_t GIRP:1;
      uint64_t TEP:1;
      uint64_t RFP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint8_t res0[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0:1;
      uint64_t F1:1;
      uint64_t F2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0:1;
      uint64_t F1:1;
      uint64_t F2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIR0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE0:1;
      uint64_t TIE1:1;
      uint64_t TIE2:1;
      uint64_t TIE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TE0:1;
      uint64_t TE1:1;
      uint64_t TE2:1;
      uint64_t TE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIE0:1;
      uint64_t RIE1:1;
      uint64_t RIE2:1;
      uint64_t RIE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0:1;
      uint64_t RF1:1;
      uint64_t RF2:1;
      uint64_t RF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSR;

