iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res3[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_3;

  uint8_t res4[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_3;

};

#define MU_2__MUA (*(volatile struct MU_2__MUA_tag *) 0x400b8000)

struct MU_2__MUB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_NUM:8;
      uint64_t RR_NUM:8;
      uint64_t GIR_NUM:8;
      uint64_t FLAG_WIDTH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MUR:1;
      uint64_t MURIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MURS:1;
      uint64_t MURIP:1;
      uint64_t EP:1;
      uint64_t FUP:1;
      uint64_t GIRP:1;
      uint64_t TEP:1;
      uint64_t RFP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint8_t res0[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0:1;
      uint64_t F1:1;
      uint64_t F2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F0:1;
      uint64_t F1:1;
      uint64_t F2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIR0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GIP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSR;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIE0:1;
      uint64_t TIE1:1;
      uint64_t TIE2:1;
      uint64_t TIE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TE0:1;
      uint64_t TE1:1;
      uint64_t TE2:1;
      uint64_t TE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RIE0:1;
      uint64_t RIE1:1;
      uint64_t RIE2:1;
      uint64_t RIE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RF0:1;
      uint64_t RF1:1;
      uint64_t RF2:1;
      uint64_t RF3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSR;

  uint8_t res3[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TR_3;

  uint8_t res4[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RR_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RR_3;

};

#define MU_2__MUB (*(volatile struct MU_2__MUB_tag *) 0x400bc000)

struct AXBS_LITE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS0;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t reservedSpace3:7;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS0;

  uint8_t res1[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS1;

