iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t reservedSpace3:7;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS1;

  uint8_t res3[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS2;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t reservedSpace3:7;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS2;

  uint8_t res5[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS3;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t reservedSpace3:7;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS3;

  uint8_t res7[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS4;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t reservedSpace3:7;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS4;

  uint8_t res9[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS5;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t reservedSpace3:7;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS5;

  uint8_t res11[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS6;

  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t reservedSpace3:7;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS6;

  uint8_t res13[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M0:3;
      uint64_t reservedSpace0:1;
      uint64_t M1:3;
      uint64_t reservedSpace1:1;
      uint64_t M2:3;
      uint64_t reservedSpace2:1;
      uint64_t M3:3;
      uint64_t reservedSpace3:1;
      uint64_t M4:3;
      uint64_t reservedSpace4:1;
      uint64_t M5:3;
      uint64_t reservedSpace5:1;
      uint64_t M6:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRS7;

  uint8_t res14[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PARK:3;
      uint64_t reservedSpace0:1;
      uint64_t PCTL:2;
      uint64_t reservedSpace1:2;
      uint64_t ARB:2;
      uint64_t reservedSpace2:6;
      uint64_t HPE0:1;
      uint64_t HPE1:1;
      uint64_t HPE2:1;
      uint64_t HPE3:1;
      uint64_t HPE4:1;
      uint64_t HPE5:1;
      uint64_t HPE6:1;
      uint64_t reservedSpace3:7;
      uint64_t HLP:1;
      uint64_t RO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRS7;

