iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define AXBS_LITE (*(volatile struct AXBS_LITE_tag *) 0x40200000)

struct XBIC_AXBS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t ME6:1;
      uint64_t ME5:1;
      uint64_t ME4:1;
      uint64_t ME3:1;
      uint64_t ME2:1;
      uint64_t ME1:1;
      uint64_t ME0:1;
      uint64_t SE7:1;
      uint64_t SE6:1;
      uint64_t SE5:1;
      uint64_t SE4:1;
      uint64_t SE3:1;
      uint64_t SE2:1;
      uint64_t SE1:1;
      uint64_t SE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t reservedSpace0:16;
      uint64_t EIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t DPME7:1;
      uint64_t DPME6:1;
      uint64_t DPME5:1;
      uint64_t DPME4:1;
      uint64_t DPME3:1;
      uint64_t DPME2:1;
      uint64_t DPME1:1;
      uint64_t DPME0:1;
      uint64_t DPSE7:1;
      uint64_t DPSE6:1;
      uint64_t DPSE5:1;
      uint64_t DPSE4:1;
      uint64_t DPSE3:1;
      uint64_t DPSE2:1;
      uint64_t DPSE1:1;
      uint64_t DPSE0:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR;

};

#define XBIC_AXBS (*(volatile struct XBIC_AXBS_tag *) 0x40204000)

struct XBIC_AXBS_PERI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:19;
      uint64_t ME4:1;
      uint64_t ME3:1;
      uint64_t ME2:1;
      uint64_t ME1:1;
      uint64_t ME0:1;
      uint64_t reservedSpace1:5;
      uint64_t SE2:1;
      uint64_t SE1:1;
      uint64_t SE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t reservedSpace0:16;
      uint64_t EIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYN:8;
      uint64_t MST:4;
      uint64_t SLV:3;
      uint64_t DPME7:1;
      uint64_t DPME6:1;
      uint64_t DPME5:1;
      uint64_t DPME4:1;
      uint64_t DPME3:1;
      uint64_t DPME2:1;
      uint64_t DPME1:1;
      uint64_t DPME0:1;
      uint64_t DPSE7:1;
      uint64_t DPSE6:1;
      uint64_t DPSE5:1;
      uint64_t DPSE4:1;
      uint64_t DPSE3:1;
      uint64_t DPSE2:1;
      uint64_t DPSE1:1;
      uint64_t DPSE0:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR;

};

#define XBIC_AXBS_PERI (*(volatile struct XBIC_AXBS_PERI_tag *) 0x40208000)

struct EDMA_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t EDBG:1;
      uint64_t ERCA:1;
      uint64_t reservedSpace1:1;
      uint64_t HAE:1;
      uint64_t HALT:1;
      uint64_t GCLC:1;
      uint64_t GMRC:1;
      uint64_t ECX:1;
      uint64_t CX:1;
      uint64_t reservedSpace2:14;
      uint64_t ACTIVE_ID:5;
      uint64_t reservedSpace3:2;
      uint64_t ACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBE:1;
      uint64_t SBE:1;
      uint64_t SGE:1;
      uint64_t NCE:1;
      uint64_t DOE:1;
      uint64_t DAE:1;
      uint64_t SOE:1;
      uint64_t SAE:1;
      uint64_t ECX:1;
      uint64_t UCE:1;
      uint64_t reservedSpace0:14;
      uint64_t ERRCHN:5;
      uint64_t reservedSpace1:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HRS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HRS;

  uint8_t res0[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRPRI:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH_GRPRI_31;

