iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define EDMA (*(volatile struct EDMA_tag *) 0x4020c000)

struct MDM_AP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DESTRST:1;
      uint64_t FUNCRST:1;
      uint64_t reservedSpace1:9;
      uint64_t CM70HLT:1;
      uint64_t CM71HLT:1;
      uint64_t CM72HLT:1;
      uint64_t HSEHLT:1;
      uint64_t CM70DPSLP:1;
      uint64_t CM71DPSLP:1;
      uint64_t CM72DPSLP:1;
      uint64_t CM0PDPSLP:1;
      uint64_t CM70SLPNG:1;
      uint64_t CM71SLPNG:1;
      uint64_t CM72SLPNG:1;
      uint64_t CM0PSLPNG:1;
      uint64_t reservedSpace2:4;
      uint64_t CM70DBGRSTRD:1;
      uint64_t CM71DBGRSTRD:1;
      uint64_t reservedSpace3:1;
      uint64_t CM72DBGRSTRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMAPSTTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SYSRESETREQ:1;
      uint64_t SYSFUNCRST:1;
      uint64_t reservedSpace1:2;
      uint64_t CM70DBGREQ:1;
      uint64_t CM71DBGREQ:1;
      uint64_t CM72DBGREQ:1;
      uint64_t reservedSpace2:1;
      uint64_t DBGRSTSLOWPAD:1;
      uint64_t reservedSpace3:2;
      uint64_t POR_WDG_DIS_FUNC_RST:1;
      uint64_t reservedSpace4:4;
      uint64_t TRIUOVRD:1;
      uint64_t reservedSpace5:1;
      uint64_t SWOOVRD:1;
      uint64_t reservedSpace6:2;
      uint64_t RSTRELCM70:1;
      uint64_t RSTRELCM71:1;
      uint64_t RSTRELCM72:1;
      uint64_t CM70DBGRSRT:1;
      uint64_t CM71DBGRSRT:1;
      uint64_t reservedSpace7:1;
      uint64_t CM72DBGRSRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMAPCTL;

  uint8_t res0[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LWPWREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMAPWIREN;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WTRSTRGM:1;
      uint64_t PRVNTRSTRGM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDMAPWIRREL;

};

#define MDM_AP (*(volatile struct MDM_AP_tag *) 0x40250600)

struct SDA_AP_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHALRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t UIDSTATUS:1;
      uint64_t SWAPPDBG:1;
      uint64_t reservedSpace1:26;
      uint64_t APPDBGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTHSTTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSEAUTHREQ:1;
      uint64_t HSENEWDATACTL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTHCTL;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYCHAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYCHAL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYCHAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYCHAL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYCHAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYCHAL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYCHAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYCHAL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYCHAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYCHAL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYCHAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYCHAL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYCHAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYCHAL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYCHAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYCHAL_7;

  uint8_t res1[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYRESP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYRESP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYRESP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYRESP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESP_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYRESP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESP_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYRESP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESP_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYRESP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESP_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEYRESP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) KEYRESP_7;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UID0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UID1;

  uint8_t res3[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t GDBGEN:1;
      uint64_t GNIDEN:1;
      uint64_t GSPIDEN:1;
      uint64_t GSPNIDEN:1;
      uint64_t reservedSpace1:20;
      uint64_t CDBGEN:1;
      uint64_t CNIDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBGENCTRL;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:25;
      uint64_t RSTRELTLCM70:1;
      uint64_t RSTRELTLCM71:1;
      uint64_t RSTRELTLCM72:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPRSTCTRL;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JTAG_CR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENCTRL0;

