iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS1;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS2;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS3;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAAPGENSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDAAPGENSTATUS4;

  uint8_t res10[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define SDA_AP (*(volatile struct SDA_AP_tag *) 0x40254700)

struct EIM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GEIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:19;
      uint64_t EICH12EN:1;
      uint64_t EICH11EN:1;
      uint64_t EICH10EN:1;
      uint64_t reservedSpace1:5;
      uint64_t EICH4EN:1;
      uint64_t EICH3EN:1;
      uint64_t EICH2EN:1;
      uint64_t EICH1EN:1;
      uint64_t EICH0EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHEN;

  uint8_t res0[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t CHKBIT_MASK:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD0_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD0_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD0_WORD2;

  uint8_t res1[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t CHKBIT_MASK:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD1_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD1_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD1_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD1_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD1_WORD4;

  uint8_t res2[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD2_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD2_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD2_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD2_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD2_WORD4;

  uint8_t res3[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD3_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD3_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD3_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD3_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD3_WORD4;

  uint8_t res4[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t CHKBIT_MASK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B8_11DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B12_15DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD4_WORD4;

  uint8_t res5[1516];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_7DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD10_WORD2;

  uint8_t res6[244];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD11_WORD1;

