iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res7[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t CHKBIT_MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_3DATA_MASK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICHD12_WORD1;

};

#define EIM_0 (*(volatile struct EIM_0_tag *) 0x40258000)

struct ERM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ENCIE7:1;
      uint64_t ESCIE7:1;
      uint64_t reservedSpace1:2;
      uint64_t ENCIE6:1;
      uint64_t ESCIE6:1;
      uint64_t reservedSpace2:2;
      uint64_t ENCIE5:1;
      uint64_t ESCIE5:1;
      uint64_t reservedSpace3:2;
      uint64_t ENCIE4:1;
      uint64_t ESCIE4:1;
      uint64_t reservedSpace4:2;
      uint64_t ENCIE3:1;
      uint64_t ESCIE3:1;
      uint64_t reservedSpace5:2;
      uint64_t ENCIE2:1;
      uint64_t ESCIE2:1;
      uint64_t reservedSpace6:2;
      uint64_t ENCIE1:1;
      uint64_t ESCIE1:1;
      uint64_t reservedSpace7:2;
      uint64_t ENCIE0:1;
      uint64_t ESCIE0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ENCIE15:1;
      uint64_t ESCIE15:1;
      uint64_t reservedSpace1:2;
      uint64_t ENCIE14:1;
      uint64_t ESCIE14:1;
      uint64_t reservedSpace2:2;
      uint64_t ENCIE13:1;
      uint64_t ESCIE13:1;
      uint64_t reservedSpace3:2;
      uint64_t ENCIE12:1;
      uint64_t ESCIE12:1;
      uint64_t reservedSpace4:2;
      uint64_t ENCIE11:1;
      uint64_t ESCIE11:1;
      uint64_t reservedSpace5:2;
      uint64_t ENCIE10:1;
      uint64_t ESCIE10:1;
      uint64_t reservedSpace6:2;
      uint64_t ENCIE9:1;
      uint64_t ESCIE9:1;
      uint64_t reservedSpace7:2;
      uint64_t ENCIE8:1;
      uint64_t ESCIE8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t ENCIE19:1;
      uint64_t ESCIE19:1;
      uint64_t reservedSpace1:2;
      uint64_t ENCIE18:1;
      uint64_t ESCIE18:1;
      uint64_t reservedSpace2:2;
      uint64_t ENCIE17:1;
      uint64_t ESCIE17:1;
      uint64_t reservedSpace3:2;
      uint64_t ENCIE16:1;
      uint64_t ESCIE16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t NCE7:1;
      uint64_t SBC7:1;
      uint64_t reservedSpace1:2;
      uint64_t NCE6:1;
      uint64_t SBC6:1;
      uint64_t reservedSpace2:2;
      uint64_t NCE5:1;
      uint64_t SBC5:1;
      uint64_t reservedSpace3:2;
      uint64_t NCE4:1;
      uint64_t SBC4:1;
      uint64_t reservedSpace4:2;
      uint64_t NCE3:1;
      uint64_t SBC3:1;
      uint64_t reservedSpace5:2;
      uint64_t NCE2:1;
      uint64_t SBC2:1;
      uint64_t reservedSpace6:2;
      uint64_t NCE1:1;
      uint64_t SBC1:1;
      uint64_t reservedSpace7:2;
      uint64_t NCE0:1;
      uint64_t SBC0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t NCE15:1;
      uint64_t SBC15:1;
      uint64_t reservedSpace1:2;
      uint64_t NCE14:1;
      uint64_t SBC14:1;
      uint64_t reservedSpace2:2;
      uint64_t NCE13:1;
      uint64_t SBC13:1;
      uint64_t reservedSpace3:2;
      uint64_t NCE12:1;
      uint64_t SBC12:1;
      uint64_t reservedSpace4:2;
      uint64_t NCE11:1;
      uint64_t SBC11:1;
      uint64_t reservedSpace5:2;
      uint64_t NCE10:1;
      uint64_t SBC10:1;
      uint64_t reservedSpace6:2;
      uint64_t NCE9:1;
      uint64_t SBC9:1;
      uint64_t reservedSpace7:2;
      uint64_t NCE8:1;
      uint64_t SBC8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t NCE19:1;
      uint64_t SBC19:1;
      uint64_t reservedSpace1:2;
      uint64_t NCE18:1;
      uint64_t SBC18:1;
      uint64_t reservedSpace2:2;
      uint64_t NCE17:1;
      uint64_t SBC17:1;
      uint64_t reservedSpace3:2;
      uint64_t NCE16:1;
      uint64_t SBC16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR2;

  uint8_t res1[228];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT0;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT1;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT2;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT3;

  uint8_t res5[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT4;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT5;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT6;

  uint8_t res8[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT7;

  uint8_t res9[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT8;

  uint8_t res10[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT9;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT10;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT11;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT12;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT13;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT14;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT15;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SYNDROME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYN16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT16;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR17;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT17;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR18;

  uint8_t res21[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT18;

  uint8_t res22[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EAR19;

  uint8_t res23[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COUNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORR_ERR_CNT19;

