iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define ERM_0 (*(volatile struct ERM_0_tag *) 0x4025c000)

struct MSCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSONALITY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPN:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXNUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RYPZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXREV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCWY:8;
      uint64_t DCSZ:8;
      uint64_t ICWY:8;
      uint64_t ICSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t L2WY:8;
      uint64_t L2SZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ITCMSZ:8;
      uint64_t DTCMSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPU:1;
      uint64_t SIMD:1;
      uint64_t MMU:1;
      uint64_t CMP:1;
      uint64_t CPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPXCFG3;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSONALITY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RYPZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0REV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCWY:8;
      uint64_t DCSZ:8;
      uint64_t ICWY:8;
      uint64_t ICSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t L2WY:8;
      uint64_t L2SZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ITCMSZ:8;
      uint64_t DTCMSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPU:1;
      uint64_t SIMD:1;
      uint64_t MMU:1;
      uint64_t CMP:1;
      uint64_t CPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP0CFG3;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSONALITY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP1TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP1NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RYPZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP1REV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCWY:8;
      uint64_t DCSZ:8;
      uint64_t ICWY:8;
      uint64_t ICSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP1CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t L2WY:8;
      uint64_t L2SZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP1CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ITCMSZ:8;
      uint64_t DTCMSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP1CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPU:1;
      uint64_t SIMD:1;
      uint64_t MMU:1;
      uint64_t CMP:1;
      uint64_t CPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP1CFG3;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PERSONALITY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP2TYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP2NUM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RYPZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP2REV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCWY:8;
      uint64_t DCSZ:8;
      uint64_t ICWY:8;
      uint64_t ICSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP2CFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t L2WY:8;
      uint64_t L2SZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP2CFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ITCMSZ:8;
      uint64_t DTCMSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP2CFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPU:1;
      uint64_t SIMD:1;
      uint64_t MMU:1;
      uint64_t CMP:1;
      uint64_t CPY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CP2CFG3;

  uint8_t res3[388];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0ISR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0IGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0ISR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0IGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0ISR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0IGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0ISR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP0IGR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1ISR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1IGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1ISR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1IGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1ISR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1IGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1ISR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP1IGR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP2ISR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP2IGR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP2ISR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP2IGR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP2ISR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP2IGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_INT:1;
      uint64_t CP1_INT:1;
      uint64_t CP2_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP2ISR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCP2IGR3;

  uint8_t res4[416];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0_TR:1;
      uint64_t CP1_TR:1;
      uint64_t CP2_TR:1;
      uint64_t reservedSpace0:28;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRCPCFG;

  uint8_t res5[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRAM0:1;
      uint64_t PRAM_1:1;
      uint64_t PRAM_2:1;
      uint64_t reservedSpace0:5;
      uint64_t CM7_0_DIS_ITCM_EXEC:1;
      uint64_t CM7_1_DIS_ITCM_EXEC:1;
      uint64_t CM7_2_DIS_ITCM_EXEC:1;
      uint64_t reservedSpace1:1;
      uint64_t CM7_0_ITCM:1;
      uint64_t CM7_1_ITCM:1;
      uint64_t CM7_2_ITCM:1;
      uint64_t reservedSpace2:1;
      uint64_t CM7_0_DIS_D0_D1TCM_EXEC:1;
      uint64_t CM7_1_DIS_D0_D1TCM_EXEC:1;
      uint64_t CM7_2_DIS_D0_D1TCM_EXEC:1;
      uint64_t reservedSpace3:1;
      uint64_t CM7_0_DTCM:1;
      uint64_t CM7_1_DTCM:1;
      uint64_t CM7_2_DTCM:1;
      uint64_t reservedSpace4:7;
      uint64_t SLK:1;
      uint64_t HLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XN_CTRL;

  uint8_t res6[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM7_0_AHBM:1;
      uint64_t CM7_0_AHBP:1;
      uint64_t EDMA_bitfield:1;
      uint64_t STAM:1;
      uint64_t HSE:1;
      uint64_t ENET:1;
      uint64_t CM7_1_AHBM:1;
      uint64_t CM7_1_AHBP:1;
      uint64_t reservedSpace0:1;
      uint64_t ADD_PF0:1;
      uint64_t ADD_PF1:1;
      uint64_t ADD_PF2:1;
      uint64_t PRAM0:1;
      uint64_t ADD_PRAM0:1;
      uint64_t PRAM1:1;
      uint64_t ADD_PRAM1:1;
      uint64_t reservedSpace1:1;
      uint64_t ADD_TCM_BACKDOOR:1;
      uint64_t QSPI:1;
      uint64_t ADD_QSPI:1;
      uint64_t AIPS0:1;
      uint64_t ADD_AIPS0:1;
      uint64_t AIPS1:1;
      uint64_t ADD_AIPS1:1;
      uint64_t AIPS2:1;
      uint64_t ADD_AIPS2:1;
      uint64_t CM7_0_TCM:1;
      uint64_t ADD_CM7_0_TCM:1;
      uint64_t CM7_1_TCM:1;
      uint64_t ADD_CM7_1_TCM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENEDC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CM7_2_AHBM:1;
      uint64_t CM7_2_AHBP:1;
      uint64_t PFLASH_3:1;
      uint64_t EDMA_S0:1;
      uint64_t EDMA_S1:1;
      uint64_t reservedSpace1:3;
      uint64_t EN_PRAM2:1;
      uint64_t ADD_EN_PRAM2:1;
      uint64_t reservedSpace2:2;
      uint64_t CM7_2_TCM:1;
      uint64_t ADD_CM7_2_TCM:1;
      uint64_t USDHC_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENEDC1;

