iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res7[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_DIS_WR_OPT:1;
      uint64_t DMA_AXBS_S0_DIS_WR_OPT:1;
      uint64_t DMA_AXBS_S1_DIS_WR_OPT:1;
      uint64_t HSE_DIS_WR_OPT:1;
      uint64_t TCM_DIS_WR_OPT:1;
      uint64_t QSPI_DIS_WR_OPT:1;
      uint64_t CM7_0_AHBS_DIS_WR_OPT:1;
      uint64_t CM7_1_AHBS_DIS_WR_OPT:1;
      uint64_t CM7_2_AHBS_DIS_WR_OPT:1;
      uint64_t AIPS1_DIS_WR_OPT:1;
      uint64_t AIPS2_DIS_WR_OPT:1;
      uint64_t AIPS0_DIS_WR_OPT:1;
      uint64_t USDHC_DIS_WR_OPT:1;
      uint64_t PRAM0_DIS_WR_OPT:1;
      uint64_t PRAM1_DIS_WR_OPT:1;
      uint64_t TCM_PRAM_DIS_WR_OPT:1;
      uint64_t PRAM2_DIS_WR_OPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IAHBCFGREG;

  uint8_t res8[380];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_12;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_14;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_15;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_16;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_17;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_18;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_19;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_20;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_21;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_22;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_23;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_24;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_25;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_26;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_27;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_28;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_29;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_30;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_31;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_32;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_33;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_34;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_35;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_36;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_37;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_38;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_39;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_40;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_41;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_42;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_43;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_44;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_45;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_46;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_47;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_48;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_49;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_50;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_51;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_52;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_53;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_54;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_55;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_56;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_57;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_58;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_59;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_60;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_61;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_62;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_63;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_64;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_65;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_66;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_67;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_68;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_69;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_70;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_71;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_72;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_73;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_74;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_75;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_76;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_77;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_78;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_79;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_80;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_81;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_82;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_83;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_84;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_85;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_86;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_87;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_88;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_89;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_90;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_91;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_92;

