iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_93;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_94;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_95;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_96;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_97;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_98;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_99;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_100;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_101;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_102;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_103;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_104;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_105;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_106;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_107;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_108;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_109;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_110;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_111;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_112;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_113;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_114;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_115;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_116;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_117;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_118;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_119;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_120;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_121;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_122;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_123;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_124;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_125;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_126;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_127;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_128;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_129;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_130;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_131;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_132;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_133;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_134;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_135;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_136;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_137;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_138;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_139;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_140;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_141;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_142;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_143;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_144;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_145;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_146;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_147;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_148;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_149;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_150;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_151;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_152;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_153;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_154;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_155;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_156;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_157;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_158;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_159;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_160;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_161;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_162;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_163;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_164;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_165;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_166;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_167;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_168;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_169;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_170;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_171;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_172;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_173;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_174;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_175;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_176;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_177;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_178;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_179;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_180;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_181;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_182;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_183;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_184;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_185;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_186;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_187;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_188;

