iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_189;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_190;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_191;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_192;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_193;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_194;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_195;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_196;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_197;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_198;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_199;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_200;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_201;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_202;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_203;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_204;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_205;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_206;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_207;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_208;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_209;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_210;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_211;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_212;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_213;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_214;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_215;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_216;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_217;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_218;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_219;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_220;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_221;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_222;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_223;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_224;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_225;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_226;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_227;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_228;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_229;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_230;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_231;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_232;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_233;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_234;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_235;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_236;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_237;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_238;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M7_0:1;
      uint64_t M7_1:1;
      uint64_t M7_2:1;
      uint64_t reservedSpace0:12;
      uint64_t LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IRSPRC_239;

