iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define PFLASH (*(volatile struct PFLASH_tag *) 0x40268000)

struct PFLASH_PFCBLKi_LOCKMASTER_S_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

};

#define PFLASH_PFCBLKi_LOCKMASTER_S_0 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_S_0_tag *) 0x402683c0)

struct PFLASH_PFCBLKi_LOCKMASTER_S_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

};

#define PFLASH_PFCBLKi_LOCKMASTER_S_1 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_S_1_tag *) 0x402683e0)

struct PFLASH_PFCBLKi_LOCKMASTER_S_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

};

#define PFLASH_PFCBLKi_LOCKMASTER_S_2 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_S_2_tag *) 0x40268400)

struct PFLASH_PFCBLKi_LOCKMASTER_S_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

};

#define PFLASH_PFCBLKi_LOCKMASTER_S_3 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_S_3_tag *) 0x40268420)

struct PFLASH_PFCBLKi_LOCKMASTER_S_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

