iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define PFLASH_PFCBLKi_LOCKMASTER_S_4 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_S_4_tag *) 0x40268440)

struct PFLASH_PFCBLKi_LOCKMASTER_SS_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_6;

};

#define PFLASH_PFCBLKi_LOCKMASTER_SS_0 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_SS_0_tag *) 0x40268484)

struct PFLASH_PFCBLKi_LOCKMASTER_SS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_6;

};

#define PFLASH_PFCBLKi_LOCKMASTER_SS_1 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_SS_1_tag *) 0x402684a0)

struct PFLASH_PFCBLKi_LOCKMASTER_SS_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_6;

};

#define PFLASH_PFCBLKi_LOCKMASTER_SS_2 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_SS_2_tag *) 0x402684bc)

struct PFLASH_PFCBLKi_LOCKMASTER_SS_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_6;

};

#define PFLASH_PFCBLKi_LOCKMASTER_SS_3 (*(volatile struct PFLASH_PFCBLKi_LOCKMASTER_SS_3_tag *) 0x402684d8)

struct PFLASH_ALT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0_CBFEN:1;
      uint64_t P0_DBFEN:1;
      uint64_t reservedSpace0:2;
      uint64_t P0_CPFEN:1;
      uint64_t P0_DPFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR0;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DERR_SUP:1;
      uint64_t BLK4_PS:3;
      uint64_t reservedSpace0:3;
      uint64_t DMEEE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t M15AP:2;
      uint64_t M14AP:2;
      uint64_t M13AP:2;
      uint64_t M12AP:2;
      uint64_t M11AP:2;
      uint64_t M10AP:2;
      uint64_t M9AP:2;
      uint64_t M8AP:2;
      uint64_t M7AP:2;
      uint64_t M6AP:2;
      uint64_t M5AP:2;
      uint64_t M4AP:2;
      uint64_t reservedSpace0:2;
      uint64_t M2AP:2;
      uint64_t M1AP:2;
      uint64_t M0AP:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFAPR;

  uint8_t res1[744];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEADR_L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCPGM_PEADR_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PEADR_P:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCPGM_PEADR_P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPEADR_L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCPGM_XPEADR_L;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XPEADR_P:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCPGM_XPEADR_P;

