iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res2[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SPELOCK_4;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLKU_SPELOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSLCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSPELOCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSLCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSPELOCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSLCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSPELOCK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSLCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSPELOCK_3;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SETSLOCK_4;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETSLCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLKU_SETSLOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSETSLCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSETSLOCK_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSETSLCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSETSLOCK_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSETSLCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSETSLOCK_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSETSLCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_SSETSLOCK_3;

  uint8_t res6[212];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLKU_LOCKMASTER_S;

};

#define PFLASH_ALT (*(volatile struct PFLASH_ALT_tag *) 0x4026c000)

struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

};

#define PFLASH_ALT_PFCBLKi_LOCKMASTER_S_0 (*(volatile struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_0_tag *) 0x4026c3c0)

struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

