iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define PFLASH_ALT_PFCBLKi_LOCKMASTER_S_1 (*(volatile struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_1_tag *) 0x4026c3e0)

struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

};

#define PFLASH_ALT_PFCBLKi_LOCKMASTER_S_2 (*(volatile struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_2_tag *) 0x4026c400)

struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

};

#define PFLASH_ALT_PFCBLKi_LOCKMASTER_S_3 (*(volatile struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_3_tag *) 0x4026c420)

struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_S:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_S_7;

};

#define PFLASH_ALT_PFCBLKi_LOCKMASTER_S_4 (*(volatile struct PFLASH_ALT_PFCBLKi_LOCKMASTER_S_4_tag *) 0x4026c440)

struct PFLASH_ALT_PFCBLKi_LOCKMASTER_SS_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_6;

};

#define PFLASH_ALT_PFCBLKi_LOCKMASTER_SS_0 (*(volatile struct PFLASH_ALT_PFCBLKi_LOCKMASTER_SS_0_tag *) 0x4026c484)

struct PFLASH_ALT_PFCBLKi_LOCKMASTER_SS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCKMASTER_SS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFCBLK_LOCKMASTER_SS_6;

