iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define SWT_2 (*(volatile struct SWT_2_tag *) 0x40470000)

struct STM_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FRZ:1;
      uint64_t reservedSpace0:6;
      uint64_t CPS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

};

#define STM_0 (*(volatile struct STM_0_tag *) 0x40274000)

struct STM_0_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_0_CHANNEL_0 (*(volatile struct STM_0_CHANNEL_0_tag *) 0x40274010)

struct STM_0_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_0_CHANNEL_1 (*(volatile struct STM_0_CHANNEL_1_tag *) 0x40274020)

struct STM_0_CHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_0_CHANNEL_2 (*(volatile struct STM_0_CHANNEL_2_tag *) 0x40274030)

struct STM_0_CHANNEL_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_0_CHANNEL_3 (*(volatile struct STM_0_CHANNEL_3_tag *) 0x40274040)

struct STM_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FRZ:1;
      uint64_t reservedSpace0:6;
      uint64_t CPS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

};

#define STM_1 (*(volatile struct STM_1_tag *) 0x40474000)

struct STM_1_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_1_CHANNEL_0 (*(volatile struct STM_1_CHANNEL_0_tag *) 0x40474010)

struct STM_1_CHANNEL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_1_CHANNEL_1 (*(volatile struct STM_1_CHANNEL_1_tag *) 0x40474020)

struct STM_1_CHANNEL_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_1_CHANNEL_2 (*(volatile struct STM_1_CHANNEL_2_tag *) 0x40474030)

struct STM_1_CHANNEL_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

};

#define STM_1_CHANNEL_3 (*(volatile struct STM_1_CHANNEL_3_tag *) 0x40474040)

struct STM_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEN:1;
      uint64_t FRZ:1;
      uint64_t reservedSpace0:6;
      uint64_t CPS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNT;

};

#define STM_2 (*(volatile struct STM_2_tag *) 0x40478000)

struct STM_2_CHANNEL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMP;

