iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t RECR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W0_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDID:4;
      uint64_t reservedSpace0:4;
      uint64_t EATR:3;
      uint64_t ERW:1;
      uint64_t reservedSpace1:12;
      uint64_t EPORT:3;
      uint64_t reservedSpace2:3;
      uint64_t EST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W1_1;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t RECR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W3_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W0_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDID:4;
      uint64_t reservedSpace0:4;
      uint64_t EATR:3;
      uint64_t ERW:1;
      uint64_t reservedSpace1:12;
      uint64_t EPORT:3;
      uint64_t reservedSpace2:3;
      uint64_t EST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W1_2;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t RECR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W3_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W0_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDID:4;
      uint64_t reservedSpace0:4;
      uint64_t EATR:3;
      uint64_t ERW:1;
      uint64_t reservedSpace1:12;
      uint64_t EPORT:3;
      uint64_t reservedSpace2:3;
      uint64_t EST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W1_3;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t RECR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W3_3;

  uint8_t res9[192];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W0_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDID:4;
      uint64_t reservedSpace0:4;
      uint64_t EATR:3;
      uint64_t ERW:1;
      uint64_t reservedSpace1:12;
      uint64_t EPORT:3;
      uint64_t reservedSpace2:3;
      uint64_t EST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W1_16;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t RECR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W3_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W0_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDID:4;
      uint64_t reservedSpace0:4;
      uint64_t EATR:3;
      uint64_t ERW:1;
      uint64_t reservedSpace1:12;
      uint64_t EPORT:3;
      uint64_t reservedSpace2:3;
      uint64_t EST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W1_17;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t RECR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W3_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W0_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDID:4;
      uint64_t reservedSpace0:4;
      uint64_t EATR:3;
      uint64_t ERW:1;
      uint64_t reservedSpace1:12;
      uint64_t EPORT:3;
      uint64_t reservedSpace2:3;
      uint64_t EST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W1_18;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:30;
      uint64_t RECR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DERR_W3_18;

  uint8_t res13[464];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:22;
      uint64_t TSM:1;
      uint64_t LK2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID0;

  uint8_t res14[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:22;
      uint64_t TSM:1;
      uint64_t LK2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:22;
      uint64_t TSM:1;
      uint64_t LK2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID4;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:22;
      uint64_t TSM:1;
      uint64_t LK2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PID6;

  uint8_t res16[228];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DID:2;
      uint64_t reservedSpace0:2;
      uint64_t DIDS:2;
      uint64_t PE:2;
      uint64_t PIDM:6;
      uint64_t reservedSpace1:2;
      uint64_t PID:6;
      uint64_t reservedSpace2:7;
      uint64_t DFMT:1;
      uint64_t LK1:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDA_W0_0_DFMT0;

  uint8_t res17[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DID:2;
      uint64_t reservedSpace0:2;
      uint64_t PA:2;
      uint64_t SA:2;
      uint64_t DIDB:1;
      uint64_t reservedSpace1:20;
      uint64_t DFMT:1;
      uint64_t LK1:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDA_W0_1_DFMT1;

  uint8_t res18[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DID:2;
      uint64_t reservedSpace0:2;
      uint64_t PA:2;
      uint64_t SA:2;
      uint64_t DIDB:1;
      uint64_t reservedSpace1:20;
      uint64_t DFMT:1;
      uint64_t LK1:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDA_W0_2_DFMT1;

  uint8_t res19[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DID:2;
      uint64_t reservedSpace0:2;
      uint64_t DIDS:2;
      uint64_t PE:2;
      uint64_t PIDM:6;
      uint64_t reservedSpace1:2;
      uint64_t PID:6;
      uint64_t reservedSpace2:7;
      uint64_t DFMT:1;
      uint64_t LK1:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDA_W0_3_DFMT0;

  uint8_t res20[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DID:2;
      uint64_t reservedSpace0:2;
      uint64_t DIDS:2;
      uint64_t PE:2;
      uint64_t PIDM:6;
      uint64_t reservedSpace1:2;
      uint64_t PID:6;
      uint64_t reservedSpace2:7;
      uint64_t DFMT:1;
      uint64_t LK1:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDA_W0_4_DFMT0;

  uint8_t res21[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DID:2;
      uint64_t reservedSpace0:2;
      uint64_t PA:2;
      uint64_t SA:2;
      uint64_t DIDB:1;
      uint64_t reservedSpace1:20;
      uint64_t DFMT:1;
      uint64_t LK1:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDA_W0_5_DFMT1;

  uint8_t res22[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DID:2;
      uint64_t reservedSpace0:2;
      uint64_t DIDS:2;
      uint64_t PE:2;
      uint64_t PIDM:6;
      uint64_t reservedSpace1:2;
      uint64_t PID:6;
      uint64_t reservedSpace2:7;
      uint64_t DFMT:1;
      uint64_t LK1:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MDA_W0_6_DFMT0;

