iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define DMAMUX_0 (*(volatile struct DMAMUX_0_tag *) 0x40280000)

struct DMAMUX_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOURCE:6;
      uint64_t TRIG:1;
      uint64_t ENBL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHCFG12;

};

#define DMAMUX_1 (*(volatile struct DMAMUX_1_tag *) 0x40284000)

struct RTC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t SUPV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCSUPV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIG_EN:1;
      uint64_t reservedSpace0:9;
      uint64_t DIV32EN:1;
      uint64_t DIV512EN:1;
      uint64_t CLKSEL:2;
      uint64_t APIIE:1;
      uint64_t APIEN:1;
      uint64_t reservedSpace1:12;
      uint64_t ROVREN:1;
      uint64_t FRZEN:1;
      uint64_t RTCIE:1;
      uint64_t CNTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t ROVRF:1;
      uint64_t reservedSpace1:2;
      uint64_t APIF:1;
      uint64_t reservedSpace2:3;
      uint64_t INV_API:1;
      uint64_t INV_RTC:1;
      uint64_t reservedSpace3:10;
      uint64_t RTCF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTCCNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APIVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APIVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTCVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCVAL;

};

#define RTC (*(volatile struct RTC_tag *) 0x40288000)

struct MC_RGM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t F_POR:1;
      uint64_t reservedSpace0:2;
      uint64_t FCCU_FTR:1;
      uint64_t STCU_URF:1;
      uint64_t reservedSpace1:1;
      uint64_t MC_RGM_FRE:1;
      uint64_t reservedSpace2:1;
      uint64_t FXOSC_FAIL:1;
      uint64_t PLL_LOL:1;
      uint64_t CORE_CLK_FAIL:1;
      uint64_t reservedSpace3:1;
      uint64_t AIPS_PLAT_CLK_FAIL:1;
      uint64_t reservedSpace4:1;
      uint64_t HSE_CLK_FAIL:1;
      uint64_t SYS_DIV_FAIL:1;
      uint64_t reservedSpace5:1;
      uint64_t HSE_TMPR_RST:1;
      uint64_t HSE_SNVS_RST:1;
      uint64_t reservedSpace6:10;
      uint64_t SW_DEST:1;
      uint64_t DEBUG_DEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DES;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t F_EXR:1;
      uint64_t reservedSpace0:2;
      uint64_t FCCU_RST:1;
      uint64_t ST_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t SWT0_RST:1;
      uint64_t SWT1_RST:1;
      uint64_t SWT2_RST:1;
      uint64_t JTAG_RST:1;
      uint64_t reservedSpace2:2;
      uint64_t PLL_AUX_bitfield:1;
      uint64_t reservedSpace3:3;
      uint64_t HSE_SWT_RST:1;
      uint64_t reservedSpace4:3;
      uint64_t HSE_BOOT_RST:1;
      uint64_t reservedSpace5:8;
      uint64_t SW_FUNC:1;
      uint64_t DEBUG_FUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FES;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t D_FCCU_RST:1;
      uint64_t reservedSpace1:2;
      uint64_t D_SWT0_RST:1;
      uint64_t D_SWT1_RST:1;
      uint64_t D_SWT2_RST:1;
      uint64_t D_JTAG_RST:1;
      uint64_t reservedSpace2:20;
      uint64_t D_DEBUG_FUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FERD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t BE_FCCU_RST:1;
      uint64_t BE_ST_DONE:1;
      uint64_t reservedSpace1:1;
      uint64_t BE_SWT0_RST:1;
      uint64_t BE_SWT1_RST:1;
      uint64_t BE_SWT2_RST:1;
      uint64_t BE_JTAG_RST:1;
      uint64_t reservedSpace2:2;
      uint64_t BE_PLL_AUX:1;
      uint64_t reservedSpace3:3;
      uint64_t BE_HSE_SWT_RST:1;
      uint64_t reservedSpace4:3;
      uint64_t BE_HSE_BOOT_RST:1;
      uint64_t reservedSpace5:8;
      uint64_t BE_SW_FUNC:1;
      uint64_t BE_DEBUG_FUNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FREC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FREC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DRET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DRET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERASSERT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DES_RES:1;
      uint64_t FES_RES:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRET_EN:1;
      uint64_t FRET_TIMEOUT:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRENTC;

