iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXCNT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFMCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFCP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IFCPR;

  uint8_t res7[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMIOSFLG16_EN:1;
      uint64_t EMIOSFLG17_EN:1;
      uint64_t EMIOSFLG18_EN:1;
      uint64_t EMIOSFLG19_EN:1;
      uint64_t EMIOSFLG20_EN:1;
      uint64_t EMIOSFLG21_EN:1;
      uint64_t EMIOSFLG22_EN:1;
      uint64_t EMIOSFLG23_EN:1;
      uint64_t reservedSpace0:8;
      uint64_t EMIOSFLG0_EN:1;
      uint64_t EMIOSFLG1_EN:1;
      uint64_t EMIOSFLG2_EN:1;
      uint64_t EMIOSFLG3_EN:1;
      uint64_t EMIOSFLG4_EN:1;
      uint64_t EMIOSFLG5_EN:1;
      uint64_t EMIOSFLG6_EN:1;
      uint64_t EMIOSFLG7_EN:1;
      uint64_t EMIOSFLG8_EN:1;
      uint64_t EMIOSFLG9_EN:1;
      uint64_t EMIOSFLG10_EN:1;
      uint64_t EMIOSFLG11_EN:1;
      uint64_t EMIOSFLG12_EN:1;
      uint64_t EMIOSFLG13_EN:1;
      uint64_t EMIOSFLG14_EN:1;
      uint64_t EMIOSFLG15_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0EOC_EN:1;
      uint64_t ADC1EOC_EN:1;
      uint64_t ADC2EOC_EN:1;
      uint64_t reservedSpace0:5;
      uint64_t LPUART0TRG_EN:1;
      uint64_t LPUART1TRG_EN:1;
      uint64_t LPUART2TRG_EN:1;
      uint64_t LPUART3TRG_EN:1;
      uint64_t reservedSpace1:4;
      uint64_t BCTUFIFO0DMA_EN:1;
      uint64_t BCTUFIFO1DMA_EN:1;
      uint64_t BCTUADC0DMA_EN:1;
      uint64_t BCTUADC1DMA_EN:1;
      uint64_t BCTUADC2DMA_EN:1;
      uint64_t BCTUFIFO0INT_EN:1;
      uint64_t BCTUFIFO1INT_EN:1;
      uint64_t BCTULISTINT_EN:1;
      uint64_t BCTUADC0INT_EN:1;
      uint64_t BCTUADC1INT_EN:1;
      uint64_t BCTUADC2INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMIOSFLG16_EN:1;
      uint64_t EMIOSFLG17_EN:1;
      uint64_t EMIOSFLG18_EN:1;
      uint64_t EMIOSFLG19_EN:1;
      uint64_t EMIOSFLG20_EN:1;
      uint64_t EMIOSFLG21_EN:1;
      uint64_t EMIOSFLG22_EN:1;
      uint64_t EMIOSFLG23_EN:1;
      uint64_t reservedSpace0:8;
      uint64_t EMIOSFLG0_EN:1;
      uint64_t EMIOSFLG1_EN:1;
      uint64_t EMIOSFLG2_EN:1;
      uint64_t EMIOSFLG3_EN:1;
      uint64_t EMIOSFLG4_EN:1;
      uint64_t EMIOSFLG5_EN:1;
      uint64_t EMIOSFLG6_EN:1;
      uint64_t EMIOSFLG7_EN:1;
      uint64_t EMIOSFLG8_EN:1;
      uint64_t EMIOSFLG9_EN:1;
      uint64_t EMIOSFLG10_EN:1;
      uint64_t EMIOSFLG11_EN:1;
      uint64_t EMIOSFLG12_EN:1;
      uint64_t EMIOSFLG13_EN:1;
      uint64_t EMIOSFLG14_EN:1;
      uint64_t EMIOSFLG15_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0EOC_EN:1;
      uint64_t ADC1EOC_EN:1;
      uint64_t ADC2EOC_EN:1;
      uint64_t reservedSpace0:5;
      uint64_t LPUART0TRG_EN:1;
      uint64_t LPUART1TRG_EN:1;
      uint64_t LPUART2TRG_EN:1;
      uint64_t LPUART3TRG_EN:1;
      uint64_t reservedSpace1:4;
      uint64_t BCTUFIFO0DMA_EN:1;
      uint64_t BCTUFIFO1DMA_EN:1;
      uint64_t BCTUADC0DMA_EN:1;
      uint64_t BCTUADC1DMA_EN:1;
      uint64_t BCTUADC2DMA_EN:1;
      uint64_t BCTUFIFO0INT_EN:1;
      uint64_t BCTUFIFO1INT_EN:1;
      uint64_t BCTULISTINT_EN:1;
      uint64_t BCTUADC0INT_EN:1;
      uint64_t BCTUADC1INT_EN:1;
      uint64_t BCTUADC2INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMIOSFLG16_EN:1;
      uint64_t EMIOSFLG17_EN:1;
      uint64_t EMIOSFLG18_EN:1;
      uint64_t EMIOSFLG19_EN:1;
      uint64_t EMIOSFLG20_EN:1;
      uint64_t EMIOSFLG21_EN:1;
      uint64_t EMIOSFLG22_EN:1;
      uint64_t EMIOSFLG23_EN:1;
      uint64_t reservedSpace0:8;
      uint64_t EMIOSFLG0_EN:1;
      uint64_t EMIOSFLG1_EN:1;
      uint64_t EMIOSFLG2_EN:1;
      uint64_t EMIOSFLG3_EN:1;
      uint64_t EMIOSFLG4_EN:1;
      uint64_t EMIOSFLG5_EN:1;
      uint64_t EMIOSFLG6_EN:1;
      uint64_t EMIOSFLG7_EN:1;
      uint64_t EMIOSFLG8_EN:1;
      uint64_t EMIOSFLG9_EN:1;
      uint64_t EMIOSFLG10_EN:1;
      uint64_t EMIOSFLG11_EN:1;
      uint64_t EMIOSFLG12_EN:1;
      uint64_t EMIOSFLG13_EN:1;
      uint64_t EMIOSFLG14_EN:1;
      uint64_t EMIOSFLG15_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADC0EOC_EN:1;
      uint64_t ADC1EOC_EN:1;
      uint64_t ADC2EOC_EN:1;
      uint64_t reservedSpace0:5;
      uint64_t LPUART0TRG_EN:1;
      uint64_t LPUART1TRG_EN:1;
      uint64_t LPUART2TRG_EN:1;
      uint64_t LPUART3TRG_EN:1;
      uint64_t reservedSpace1:4;
      uint64_t BCTUFIFO0DMA_EN:1;
      uint64_t BCTUFIFO1DMA_EN:1;
      uint64_t BCTUADC0DMA_EN:1;
      uint64_t BCTUADC1DMA_EN:1;
      uint64_t BCTUADC2DMA_EN:1;
      uint64_t BCTUFIFO0INT_EN:1;
      uint64_t BCTUFIFO1INT_EN:1;
      uint64_t BCTULISTINT_EN:1;
      uint64_t BCTUADC0INT_EN:1;
      uint64_t BCTUADC1INT_EN:1;
      uint64_t BCTUADC2INT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDR4;

  uint8_t res8[232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYS_RAM_SIZE:6;
      uint64_t reservedSpace0:4;
      uint64_t PART_NO_SUF:6;
      uint64_t PROD_FAM_NO:10;
      uint64_t PROD_FAM_LET:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CORE_PLAT_FET:3;
      uint64_t EMAC_FET:2;
      uint64_t SEC_FET:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR4;

