iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res12[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR63;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR65;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR66;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR67;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR68;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR69;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR70;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR71;

  uint8_t res13[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR80;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR81;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR82;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR83;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR84;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR85;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR86;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR87;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR88;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR89;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR90;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR91;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR92;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR93;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR94;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR95;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR96;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR97;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR98;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR99;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR100;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR101;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR102;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR103;

  uint8_t res14[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR112;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR113;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR114;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR115;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR116;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR117;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR118;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR119;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR120;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR121;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR122;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR123;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR124;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR125;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR126;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR127;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR128;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR129;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR130;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR131;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR132;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR133;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR134;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR135;

  uint8_t res15[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR144;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR145;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR146;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR147;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR148;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR149;

  uint8_t res16[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR152;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR153;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR154;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR155;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR156;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR157;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR158;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR159;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR160;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR161;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR162;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR163;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR164;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR165;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR166;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR167;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR168;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR169;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR170;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR171;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR172;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR173;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR174;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR175;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR176;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR177;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR178;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR179;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR180;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR181;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR182;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR183;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR184;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR185;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR186;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR187;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR188;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR189;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR190;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR191;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR192;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR193;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR194;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR195;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR196;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR197;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR198;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR199;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR200;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR201;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR202;

