iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res17[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR211;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR212;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR213;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR214;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR215;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR216;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR217;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR218;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR219;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR220;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR221;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR222;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR223;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR224;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR225;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR226;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR227;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR228;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR229;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR230;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR231;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR232;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR233;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR234;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR235;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR236;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR237;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR238;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR239;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR240;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR241;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR242;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR243;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR244;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR245;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR246;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR247;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR248;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR249;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR250;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR251;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR252;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR253;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR254;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR255;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR256;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR257;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR258;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR259;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR260;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR261;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR262;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR263;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR264;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR265;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR266;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR267;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR268;

  uint8_t res18[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR289;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR290;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR291;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR292;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR293;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR294;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR295;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR296;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR297;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR298;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR299;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR300;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR301;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR302;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR303;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR304;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR305;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR306;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR307;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR308;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR309;

  uint8_t res19[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR315;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR316;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR317;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR318;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR319;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR320;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR321;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR322;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR323;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR324;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR325;

  uint8_t res20[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR343;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR344;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR345;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR346;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR347;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR348;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR349;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR350;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR351;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR352;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR353;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR354;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR355;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR356;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR357;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR358;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR359;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR360;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR361;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR362;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR363;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR364;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR365;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR366;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR367;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR368;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR369;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR370;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR371;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR372;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR373;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR374;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR375;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR376;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR377;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR378;

  uint8_t res21[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR389;

  uint8_t res22[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR398;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR399;

  uint8_t res23[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR409;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR410;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR411;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR412;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR413;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR414;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR415;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR416;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR417;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR418;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR419;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR420;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR421;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR422;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR423;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR424;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR425;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR426;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR427;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR428;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR429;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR430;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR431;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR432;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR433;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR434;

  uint8_t res24[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR437;

  uint8_t res25[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMCR440;

