iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO169;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO168;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO175;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO174;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO173;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO172;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO179;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO178;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO177;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO176;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO183;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO182;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO181;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO180;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO187;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO186;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO185;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO184;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO191;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO190;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO189;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO188;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO195;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO194;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO193;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO192;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO199;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO198;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO197;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO196;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO203;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO202;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO201;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO200;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO207;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO206;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO205;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO204;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO211;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO210;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO209;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO208;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO215;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO214;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO213;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO212;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO219;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO218;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO217;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO216;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO223;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO222;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO221;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO220;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO227;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO226;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO225;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO224;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO231;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO230;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO229;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO228;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO235;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO234;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO233;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO232;

  uint8_t res28[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDO_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDO236;

  uint8_t res29[272];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI7;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI6;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI5;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI11;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI10;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI9;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI8;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI15;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI14;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI13;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI12;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI19;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI18;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI17;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI16;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI23;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI22;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI21;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI20;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI27;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI26;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI25;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI24;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI31;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI30;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI29;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI28;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI35;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI34;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI33;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI32;

  uint8_t res30[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI37;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI36;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI43;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI42;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI41;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI40;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI47;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI46;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI45;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI44;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI51;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI50;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI49;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI48;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI55;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI54;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI53;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI52;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI59;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI58;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI57;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI56;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI63;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI62;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI61;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI60;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI67;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI66;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI65;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI64;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI71;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI70;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI69;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI68;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI75;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI74;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI73;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI72;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI79;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI78;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI77;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI76;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI83;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI82;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI81;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI80;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI87;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI86;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI85;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI84;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI91;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI90;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI89;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI88;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI95;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI94;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI93;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI92;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI99;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI98;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI97;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI96;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI103;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI102;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI101;

