iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI100;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI107;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI106;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI105;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI104;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI111;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI110;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI109;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI108;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI115;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI114;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI113;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI112;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI119;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI118;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI117;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI116;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI123;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI122;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI121;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI120;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI127;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI126;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI125;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI124;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI131;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI130;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI129;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI128;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI135;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI134;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI133;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI132;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI139;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI138;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI137;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI136;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI143;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI142;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI141;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI140;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI147;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI146;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI145;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI144;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI151;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI150;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI149;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI148;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI155;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI154;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI153;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI152;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI159;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI158;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI157;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI156;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI163;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI162;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI161;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI160;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI167;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI166;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI165;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI164;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI171;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI170;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI169;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI168;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI175;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI174;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI173;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI172;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI179;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI178;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI177;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI176;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI183;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI182;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI181;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI180;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI187;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI186;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI185;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI184;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI191;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI190;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI189;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI188;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI195;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI194;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI193;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI192;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI199;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI198;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI197;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI196;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI203;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI202;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI201;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI200;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI207;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI206;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI205;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI204;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI211;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI210;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI209;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI208;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI215;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI214;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI213;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI212;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI219;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI218;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI217;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI216;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI223;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI222;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI221;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI220;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI227;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI226;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI225;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI224;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI231;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI230;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI229;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI228;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI235;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI234;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI233;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI232;

  uint8_t res31[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PDI_n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) GPDI236;

  uint8_t res32[272];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t reservedSpace0:2;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO9;

