iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDO0:1;
      uint64_t PPDO1:1;
      uint64_t PPDO2:1;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO12;

  uint8_t res33[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PPDO3:1;
      uint64_t PPDO4:1;
      uint64_t PPDO5:1;
      uint64_t PPDO6:1;
      uint64_t PPDO7:1;
      uint64_t PPDO8:1;
      uint64_t PPDO9:1;
      uint64_t PPDO10:1;
      uint64_t PPDO11:1;
      uint64_t PPDO12:1;
      uint64_t PPDO13:1;
      uint64_t PPDO14:1;
      uint64_t PPDO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDO14;

  uint8_t res34[32];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI3;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t reservedSpace0:2;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI5;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI4;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI7;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI6;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI9;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI8;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI11;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI10;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI13;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PPDI0:1;
      uint64_t PPDI1:1;
      uint64_t PPDI2:1;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI12;

  uint8_t res35[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t PPDI3:1;
      uint64_t PPDI4:1;
      uint64_t PPDI5:1;
      uint64_t PPDI6:1;
      uint64_t PPDI7:1;
      uint64_t PPDI8:1;
      uint64_t PPDI9:1;
      uint64_t PPDI10:1;
      uint64_t PPDI11:1;
      uint64_t PPDI12:1;
      uint64_t PPDI13:1;
      uint64_t PPDI14:1;
      uint64_t PPDI15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PGPDI14;

