iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define SIUL2 (*(volatile struct SIUL2_tag *) 0x40290004)

struct VIRT_WRAPPER_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t reservedSpace0:4;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
      uint64_t PAD_13:2;
      uint64_t PAD_14:2;
      uint64_t PAD_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PAD_0:2;
      uint64_t PAD_1:2;
      uint64_t PAD_2:2;
      uint64_t PAD_3:2;
      uint64_t PAD_4:2;
      uint64_t PAD_5:2;
      uint64_t PAD_6:2;
      uint64_t PAD_7:2;
      uint64_t PAD_8:2;
      uint64_t PAD_9:2;
      uint64_t PAD_10:2;
      uint64_t PAD_11:2;
      uint64_t PAD_12:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_A14;

