iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res0[68];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t reservedSpace0:4;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B16;

