iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t reservedSpace0:10;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t INMUX_5:2;
      uint64_t reservedSpace1:16;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:18;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t INMUX_3:2;
      uint64_t INMUX_4:2;
      uint64_t INMUX_5:2;
      uint64_t INMUX_6:2;
      uint64_t INMUX_7:2;
      uint64_t INMUX_8:2;
      uint64_t INMUX_9:2;
      uint64_t INMUX_10:2;
      uint64_t INMUX_11:2;
      uint64_t INMUX_12:2;
      uint64_t INMUX_13:2;
      uint64_t INMUX_14:2;
      uint64_t INMUX_15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INMUX_0:2;
      uint64_t INMUX_1:2;
      uint64_t INMUX_2:2;
      uint64_t reservedSpace0:4;
      uint64_t INMUX_5:2;
      uint64_t reservedSpace1:4;
      uint64_t INMUX_8:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_B27;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTC_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG_C1039_1024;

};

#define VIRT_WRAPPER (*(volatile struct VIRT_WRAPPER_tag *) 0x402a8000)

struct DCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDONE:1;
      uint64_t DCMERR:1;
      uint64_t reservedSpace0:2;
      uint64_t DCMLCST:1;
      uint64_t reservedSpace1:3;
      uint64_t DCMUTS:1;
      uint64_t DCMOTAS:1;
      uint64_t DCMDBGPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMCLC:3;
      uint64_t DCMLCFN:1;
      uint64_t DCMRLC:3;
      uint64_t reservedSpace0:1;
      uint64_t DCMFLC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMLCC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMLCSS1:1;
      uint64_t DCMLCC1:3;
      uint64_t DCMLCE1:1;
      uint64_t DCMLCFE1:1;
      uint64_t DCMLCSS2:1;
      uint64_t DCMLCC2:3;
      uint64_t DCMLCE2:1;
      uint64_t DCMLCFE2:1;
      uint64_t DCMLCSS3:1;
      uint64_t DCMLCC3:3;
      uint64_t DCMLCE3:1;
      uint64_t DCMLCFE3:1;
      uint64_t DCMLCSS4:1;
      uint64_t DCMLCC4:3;
      uint64_t DCMLCE4:1;
      uint64_t DCMLCFE4:1;
      uint64_t DCMLCSS5:1;
      uint64_t DCMLCC5:3;
      uint64_t DCMLCE5:1;
      uint64_t DCMLCFE5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMLCS;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t DCMDBGT:1;
      uint64_t DCMDBGE:1;
      uint64_t reservedSpace1:16;
      uint64_t DCMCERS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMMISC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t DCM_APPDBG_STAT:1;
      uint64_t reservedSpace1:14;
      uint64_t APPDBG_STAT_SOC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMDEB;

