iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMECT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMDCFE1:21;
      uint64_t reservedSpace0:3;
      uint64_t DCMDCFF1:3;
      uint64_t DCMESF1:1;
      uint64_t DCMESD1:1;
      uint64_t DCMDCFT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMSRR16;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCMLCSS6:1;
      uint64_t DCMLCC6:3;
      uint64_t DCMLCE6:1;
      uint64_t DCMLCFE6:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMLCS_2;

};

#define DCM (*(volatile struct DCM_tag *) 0x402ac000)

struct DCM_GPR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCU_ISO_STATUS:1;
      uint64_t HSE_DCF_VIO:1;
      uint64_t KEY_RESP_READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD1;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM7_0_LOCKUP:1;
      uint64_t CM7_1_LOCKUP:1;
      uint64_t HSE_LOCKUP:1;
      uint64_t CM7_RCCU1_ALARM:1;
      uint64_t CM7_RCCU2_ALARM:1;
      uint64_t TCM_GSKT_ALARM:1;
      uint64_t DMA_SYS_GSKT_ALARM:1;
      uint64_t DMA_PERIPH_GSKT_ALARM:1;
      uint64_t SYS_AXBS_ALARM:1;
      uint64_t DMA_AXBS_ALARM:1;
      uint64_t SDHC_GSKT_ALARM:1;
      uint64_t HSE_GSKT_ALARM:1;
      uint64_t QSPI_GSKT_ALARM:1;
      uint64_t AIPS1_GSKT_ALARM:1;
      uint64_t AIPS2_GSKT_ALARM:1;
      uint64_t ADDR_EDC_ERR:1;
      uint64_t DATA_EDC_ERR:1;
      uint64_t TCM_AXBS_ALARM:1;
      uint64_t EMAC_GSKT_ALARM:1;
      uint64_t PERIPH_AXBS_ALARM:1;
      uint64_t PF3_CODE_ECC_ERR:1;
      uint64_t PF3_DATA_ECC_ERR:1;
      uint64_t LC_ERR:1;
      uint64_t PRAM2_ECC_ERR:1;
      uint64_t PRAM1_ECC_ERR:1;
      uint64_t PRAM0_ECC_ERR:1;
      uint64_t CM7_0_DCDATA_ECC_ERR:1;
      uint64_t CM7_1_DCDATA_ECC_ERR:1;
      uint64_t CM7_0_DCTAG_ECC_ERR:1;
      uint64_t CM7_1_DCTAG_ECC_ERR:1;
      uint64_t CM7_0_ICDATA_ECC_ERR:1;
      uint64_t CM7_1_ICDATA_ECC_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM7_0_ICTAG_ECC_ERR:1;
      uint64_t CM7_1_ICTAG_ECC_ERR:1;
      uint64_t CM7_0_ITCM_ECC_ERR:1;
      uint64_t CM7_0_DTCM0_ECC_ERR:1;
      uint64_t CM7_0_DTCM1_ECC_ERR:1;
      uint64_t CM7_1_ITCM_ECC_ERR:1;
      uint64_t CM7_1_DTCM0_ECC_ERR:1;
      uint64_t CM7_1_DTCM1_ECC_ERR:1;
      uint64_t DMA_TCD_RAM_ECC_ERR:1;
      uint64_t PRAM0_FCCU_ALARM:1;
      uint64_t PRAM1_FCCU_ALARM:1;
      uint64_t HSE_RAM_ECC_ERR:1;
      uint64_t PF0_CODE_ECC_ERR:1;
      uint64_t PF0_DATA_ECC_ERR:1;
      uint64_t PF1_CODE_ECC_ERR:1;
      uint64_t PF1_DATA_ECC_ERR:1;
      uint64_t PF2_CODE_ECC_ERR:1;
      uint64_t PF2_DATA_ECC_ERR:1;
      uint64_t FLASH_EDC_ERR:1;
      uint64_t FLASH_ADDR_ENC_ERR:1;
      uint64_t FLASH_REF_ERR:1;
      uint64_t FLASH_RST_ERR:1;
      uint64_t FLASH_SCAN_ERR:1;
      uint64_t PRAM2_FCCU_ALARM:1;
      uint64_t FLASH_ACCESS_ERR:1;
      uint64_t reservedSpace0:1;
      uint64_t VDD1P1_GNG_ERR:1;
      uint64_t VDD2P5_GNG_ERR:1;
      uint64_t SDHC_RDATA_EDC_ERR:1;
      uint64_t TEST_ACTIVATION_0_ERR:1;
      uint64_t TEST_ACTIVATION_1_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t INTM_0_ERR:1;
      uint64_t INTM_1_ERR:1;
      uint64_t INTM_2_ERR:1;
      uint64_t INTM_3_ERR:1;
      uint64_t SW_NCF_0:1;
      uint64_t SW_NCF_1:1;
      uint64_t SW_NCF_2:1;
      uint64_t SW_NCF_3:1;
      uint64_t STCU_NCF:1;
      uint64_t MBIST_ACTIVATION_ERR:1;
      uint64_t STCU_BIST_USER_CF:1;
      uint64_t MTR_BUS_ERR:1;
      uint64_t DEBUG_ACTIVATION_ERR:1;
      uint64_t TCM_RDATA_EDC_ERR:1;
      uint64_t EMAC_RDATA_EDC_ERR:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA_RDATA_EDC_ERR:1;
      uint64_t CM7_1_AHBP_RDATA_EDC_ERR:1;
      uint64_t CM7_1_AHBM_RDATA_EDC_ERR:1;
      uint64_t CM7_0_AHBP_RDATA_EDC_ERR:1;
      uint64_t CM7_0_AHBM_RDATA_EDC_ERR:1;
      uint64_t HSE_RDATA_EDC_ERR:1;
      uint64_t CM7_2_AHBP_RDATA_EDC_ERR:1;
      uint64_t CM7_2_AHBM_RDATA_EDC_ERR:1;
      uint64_t CM7_2_DCDATA_ECC_ERR:1;
      uint64_t CM7_2_DCTAG_ECC_ERR:1;
      uint64_t CM7_2_ICDATA_ECC_ERR:1;
      uint64_t CM7_2_ICTAG_ECC_ERR:1;
      uint64_t CM7_2_ITCM_ECC_ERR:1;
      uint64_t CM7_2_DTCM0_ECC_ERR:1;
      uint64_t CM7_2_DTCM1_ECC_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD5;

