iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRAM0_GSKT_ALARM:1;
      uint64_t PRAM1_GSKT_ALARM:1;
      uint64_t PRAM2_TCM_GSKT_ALARM:1;
      uint64_t PRAM2_GSKT_ALARM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROD8;

  uint8_t res2[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMAC_MDC_CHID_0:1;
      uint64_t EMAC_MDC_CHID_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID4:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID5:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID6:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID7:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID8:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID9:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID10:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID11:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID12:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID13:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID14:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_SDID15:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF17;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:29;
      uint64_t LOCKSTEP_EN:1;
      uint64_t DCM_DONE:1;
      uint64_t FCCU_EOUT_DEDICATED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_EN:1;
      uint64_t LMAUTO_DIS:1;
      uint64_t reservedSpace0:1;
      uint64_t DMA_AXBS_IAHB_BYP:1;
      uint64_t reservedSpace1:1;
      uint64_t QSPI_IAHB_BYP:1;
      uint64_t AIPS_IAHB_BYP:1;
      uint64_t reservedSpace2:11;
      uint64_t DCF_DEST_RST_ESC:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCF_DEST_RST_ESC:18;
      uint64_t reservedSpace0:1;
      uint64_t HSE_CLK_MODE_OPTION:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROF21;

  uint8_t res4[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t CLKOUT_STANDBY:1;
      uint64_t reservedSpace1:4;
      uint64_t STANBDY_PWDOG_DIS:1;
      uint64_t POR_WDOG_TRIM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWP1;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:9;
      uint64_t DEST_RST9_AS_IPI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWP3;

  uint8_t res6[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t EOUT_STAT_DUR_STEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM7_0_LOCKUP_EN:1;
      uint64_t CM7_1_LOCKUP_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t CM7_RCCU1_ALARM_EN:1;
      uint64_t CM7_RCCU2_ALARM_EN:1;
      uint64_t TCM_GSKT_ALARM_EN:1;
      uint64_t DMA_SYS_GSKT_ALARM_EN:1;
      uint64_t DMA_PERIPH_GSKT_ALARM_EN:1;
      uint64_t SYS_AXBS_ALARM_EN:1;
      uint64_t DMA_AXBS_ALARM_EN:1;
      uint64_t SDHC_GSKT_ALARM_EN:1;
      uint64_t HSE_GSKT_ALARM_EN:1;
      uint64_t QSPI_GSKT_ALARM_EN:1;
      uint64_t AIPS1_GSKT_ALARM_EN:1;
      uint64_t AIPS2_GSKT_ALARM_EN:1;
      uint64_t ADDR_EDC_ERR_EN:1;
      uint64_t DATA_EDC_ERR_EN:1;
      uint64_t TCM_AXBS_ALARM_EN:1;
      uint64_t EMAC_GSKT_ALARM_EN:1;
      uint64_t PERIPH_AXBS_ALARM_EN:1;
      uint64_t PF3_CODE_ECC_ERR_EN:1;
      uint64_t PF3_DATA_ECC_ERR_EN:1;
      uint64_t LC_ERR_EN:1;
      uint64_t PRAM2_ECC_ERR_EN:1;
      uint64_t PRAM1_ECC_ERR_EN:1;
      uint64_t PRAM0_ECC_ERR_EN:1;
      uint64_t CM7_0_DCDATA_ECC_ERR_EN:1;
      uint64_t CM7_1_DCDATA_ECC_ERR_EN:1;
      uint64_t CM7_0_DCTAG_ECC_ERR_EN:1;
      uint64_t CM7_1_DCTAG_ECC_ERR_EN:1;
      uint64_t CM7_0_ICDATA_ECC_ERR_EN:1;
      uint64_t CM7_1_ICDATA_ECC_ERR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CM7_0_ICTAG_ECC_ERR_EN:1;
      uint64_t CM7_1_ICTAG_ECC_ERR_EN:1;
      uint64_t CM7_0_ITCM_ECC_ERR_EN:1;
      uint64_t CM7_0_DTCM0_ECC_ERR_EN:1;
      uint64_t CM7_0_DTCM1_ECC_ERR_EN:1;
      uint64_t CM7_1_ITCM_ECC_ERR_EN:1;
      uint64_t CM7_1_DTCM0_ECC_ERR_EN:1;
      uint64_t CM7_1_DTCM1_ECC_ERR_EN:1;
      uint64_t DMA_TCD_RAM_ECC_ERR_EN:1;
      uint64_t PRAM0_FCCU_ALARM_EN:1;
      uint64_t PRAM1_FCCU_ALARM_EN:1;
      uint64_t HSE_RAM_ECC_ERR_EN:1;
      uint64_t PF0_CODE_ECC_ERR_EN:1;
      uint64_t PF0_DATA_ECC_ERR_EN:1;
      uint64_t PF1_CODE_ECC_ERR_EN:1;
      uint64_t PF1_DATA_ECC_ERR_EN:1;
      uint64_t PF2_CODE_ECC_ERR_EN:1;
      uint64_t PF2_DATA_ECC_ERR_EN:1;
      uint64_t FLASH_EDC_ERR_EN:1;
      uint64_t FLASH_ADDR_ENC_ERR_EN:1;
      uint64_t FLASH_REF_ERR_EN:1;
      uint64_t FLASH_RST_ERR_EN:1;
      uint64_t FLASH_SCAN_ERR_EN:1;
      uint64_t PRAM2_FCCU_ALARM_EN:1;
      uint64_t FLASH_ACCESS_ERR_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t VDD1P1_GNG_ERR_EN:1;
      uint64_t VDD2P5_GNG_ERR_EN:1;
      uint64_t SDHC_RDATA_EDC_ERR_EN:1;
      uint64_t TEST_ACTIVATION_0_ERR_EN:1;
      uint64_t TEST_ACTIVATION_1_ERR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t INTM_0_ERR_EN:1;
      uint64_t INTM_1_ERR_EN:1;
      uint64_t INTM_2_ERR_EN:1;
      uint64_t INTM_3_ERR_EN:1;
      uint64_t SW_NCF_0_EN:1;
      uint64_t SW_NCF_1_EN:1;
      uint64_t SW_NCF_2_EN:1;
      uint64_t SW_NCF_3_EN:1;
      uint64_t STCU_NCF_EN:1;
      uint64_t MBIST_ACTIVATION_ERR_EN:1;
      uint64_t STCU_BIST_USER_CF_EN:1;
      uint64_t MTR_BUS_ERR_EN:1;
      uint64_t DEBUG_ACTIVATION_ERR_EN:1;
      uint64_t TCM_RDATA_EDC_ERR_EN:1;
      uint64_t EMAC_RDATA_EDC_ERR_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t DMA_RDATA_EDC_ERR_EN:1;
      uint64_t CM7_1_AHBP_RDATA_EDC_ERR_EN:1;
      uint64_t CM7_1_AHBM_RDATA_EDC_ERR_EN:1;
      uint64_t CM7_0_AHBP_RDATA_EDC_ERR_EN:1;
      uint64_t CM7_0_AHBM_RDATA_EDC_ERR_EN:1;
      uint64_t HSE_RDATA_EDC_ERR_EN:1;
      uint64_t CM7_2_AHBP_RDATA_EDC_ERR_EN:1;
      uint64_t CM7_2_AHBM_RDATA_EDC_ERR_EN:1;
      uint64_t CM7_2_DCDATA_ECC_ERR_EN:1;
      uint64_t CM7_2_DCTAG_ECC_ERR_EN:1;
      uint64_t CM7_2_ICDATA_ECC_ERR_EN:1;
      uint64_t CM7_2_ICTAG_ECC_ERR_EN:1;
      uint64_t CM7_2_ITCM_ECC_ERR_EN:1;
      uint64_t CM7_2_DTCM0_ECC_ERR_EN:1;
      uint64_t CM7_2_DTCM1_ECC_ERR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDMA_DBG_DIS_CM7_0:1;
      uint64_t FCCU_DBG_DIS_CM7_0:1;
      uint64_t LCU0_DBG_DIS_CM7_0:1;
      uint64_t LCU1_DBG_DIS_CM7_0:1;
      uint64_t EMIOS0_DBG_DIS_CM7_0:1;
      uint64_t EMIOS1_DBG_DIS_CM7_0:1;
      uint64_t EMIOS2_DBG_DIS_CM7_0:1;
      uint64_t RTC_DBG_DIS_CM7_0:1;
      uint64_t SWT0_DBG_DIS_CM7_0:1;
      uint64_t SWT1_DBG_DIS_CM7_0:1;
      uint64_t STM0_DBG_DIS_CM7_0:1;
      uint64_t STM1_DBG_DIS_CM7_0:1;
      uint64_t PIT0_DBG_DIS_CM7_0:1;
      uint64_t PIT1_DBG_DIS_CM7_0:1;
      uint64_t PIT2_DBG_DIS_CM7_0:1;
      uint64_t LPSPI0_DBG_DIS_CM7_0:1;
      uint64_t LPSPI1_DBG_DIS_CM7_0:1;
      uint64_t LPSPI2_DBG_DIS_CM7_0:1;
      uint64_t LPSPI3_DBG_DIS_CM7_0:1;
      uint64_t LPSPI4_DBG_DIS_CM7_0:1;
      uint64_t LPSPI5_DBG_DIS_CM7_0:1;
      uint64_t LPI2C0_DBG_DIS_CM7_0:1;
      uint64_t LPI2C1_DBG_DIS_CM7_0:1;
      uint64_t FLEXIO_DBG_DIS_CM7_0:1;
      uint64_t FLEXCAN0_DBG_DIS_CM7_0:1;
      uint64_t FLEXCAN1_DBG_DIS_CM7_0:1;
      uint64_t FLEXCAN2_DBG_DIS_CM7_0:1;
      uint64_t FLEXCAN3_DBG_DIS_CM7_0:1;
      uint64_t FLEXCAN4_DBG_DIS_CM7_0:1;
      uint64_t FLEXCAN5_DBG_DIS_CM7_0:1;
      uint64_t SAI0_DBG_DIS_CM7_0:1;
      uint64_t SAI1_DBG_DIS_CM7_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I3C_DBG_DIS_CM7_0:1;
      uint64_t FLEXCAN6_DBG_DIS_CM7_0:1;
      uint64_t FLEXCAN7_DBG_DIS_CM7_0:1;
      uint64_t STM2_DBG_DIS_CM7_0:1;
      uint64_t SWT2_DBG_DIS_CM7_0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDMA_DBG_DIS_CM7_1:1;
      uint64_t FCCU_DBG_DIS_CM7_1:1;
      uint64_t LCU0_DBG_DIS_CM7_1:1;
      uint64_t LCU1_DBG_DIS_CM7_1:1;
      uint64_t reservedSpace0:3;
      uint64_t RTC_DBG_DIS_CM7_1:1;
      uint64_t SWT0_DBG_DIS_CM7_1:1;
      uint64_t SWT1_DBG_DIS_CM7_1:1;
      uint64_t STM0_DBG_DIS_CM7_1:1;
      uint64_t STM1_DBG_DIS_CM7_1:1;
      uint64_t PIT0_DBG_DIS_CM7_1:1;
      uint64_t PIT1_DBG_DIS_CM7_1:1;
      uint64_t PIT2_DBG_DIS_CM7_1:1;
      uint64_t LPSPI0_DBG_DIS_CM7_1:1;
      uint64_t LPSPI1_DBG_DIS_CM7_1:1;
      uint64_t LPSPI2_DBG_DIS_CM7_1:1;
      uint64_t LPSPI3_DBG_DIS_CM7_1:1;
      uint64_t LPSPI4_DBG_DIS_CM7_1:1;
      uint64_t LPSPI5_DBG_DIS_CM7_1:1;
      uint64_t LPI2C0_DBG_DIS_CM7_1:1;
      uint64_t LPI2C1_DBG_DIS_CM7_1:1;
      uint64_t FLEXIO_DBG_DIS_CM7_1:1;
      uint64_t FLEXCAN0_DBG_DIS_CM7_1:1;
      uint64_t FLEXCAN1_DBG_DIS_CM7_1:1;
      uint64_t FLEXCAN2_DBG_DIS_CM7_1:1;
      uint64_t FLEXCAN3_DBG_DIS_CM7_1:1;
      uint64_t FLEXCAN4_DBG_DIS_CM7_1:1;
      uint64_t FLEXCAN5_DBG_DIS_CM7_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I3C_DBG_DIS_CM7_1:1;
      uint64_t FLEXCAN6_DBG_DIS_CM7_1:1;
      uint64_t FLEXCAN7_DBG_DIS_CM7_1:1;
      uint64_t STM2_DBG_DIS_CM7_1:1;
      uint64_t SWT2_DBG_DIS_CM7_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD9;

