iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDMA_DBG_DIS_CM7_2:1;
      uint64_t FCCU_DBG_DIS_CM7_2:1;
      uint64_t LCU0_DBG_DIS_CM7_2:1;
      uint64_t LCU1_DBG_DIS_CM7_2:1;
      uint64_t eMIOS0_DBG_DIS_CM7_2:1;
      uint64_t eMIOS1_DBG_DIS_CM7_2:1;
      uint64_t eMIOS2_DBG_DIS_CM7_2:1;
      uint64_t RTC_DBG_DIS_CM7_2:1;
      uint64_t SWT0_DBG_DIS_CM7_2:1;
      uint64_t SWT1_DBG_DIS_CM7_2:1;
      uint64_t STM0_DBG_DIS_CM7_2:1;
      uint64_t STM1_DBG_DIS_CM7_2:1;
      uint64_t PIT0_DBG_DIS_CM7_2:1;
      uint64_t PIT1_DBG_DIS_CM7_2:1;
      uint64_t PIT2_DBG_DIS_CM7_2:1;
      uint64_t LPSPI0_DBG_DIS_CM7_2:1;
      uint64_t LPSPI1_DBG_DIS_CM7_2:1;
      uint64_t LPSPI2_DBG_DIS_CM7_2:1;
      uint64_t LPSPI3_DBG_DIS_CM7_2:1;
      uint64_t LPSPI4_DBG_DIS_CM7_2:1;
      uint64_t LPSPI5_DBG_DIS_CM7_2:1;
      uint64_t LPI2C0_DBG_DIS_CM7_2:1;
      uint64_t LPI2C1_DBG_DIS_CM7_2:1;
      uint64_t FLEXIO_DBG_DIS_CM7_2:1;
      uint64_t FLEXCAN0_DBG_DIS_CM7_2:1;
      uint64_t FLEXCAN1_DBG_DIS_CM7_2:1;
      uint64_t FLEXCAN2_DBG_DIS_CM7_2:1;
      uint64_t FLEXCAN3_DBG_DIS_CM7_2:1;
      uint64_t FLEXCAN4_DBG_DIS_CM7_2:1;
      uint64_t FLEXCAN5_DBG_DIS_CM7_2:1;
      uint64_t SAI0_DBG_DIS_CM7_2:1;
      uint64_t SAI1_DBG_DIS_CM7_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t I3C0_DBG_DIS_CM7_2:1;
      uint64_t FLEXCAN6_DBG_DIS_CM7_2:1;
      uint64_t FLEXCAN7_DBG_DIS_CM7_2:1;
      uint64_t STM2_DBG_DIS_CM7_2:1;
      uint64_t SWT2_DBG_DIS_CM7_2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD13;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRAM0_GSKT_ALARM_EN:1;
      uint64_t PRAM1_GSKT_ALARM_EN:1;
      uint64_t PRAM2_TCM_GSKT_ALARM_EN:1;
      uint64_t PRAM2_GSKT_ALARM_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWD16;

  uint8_t res9[196];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAN_TIMESTAMP_SEL:1;
      uint64_t CAN_TIMESTAMP_EN:1;
      uint64_t FCCU_SW_NCF0:1;
      uint64_t FCCU_SW_NCF1:1;
      uint64_t FCCU_SW_NCF2:1;
      uint64_t FCCU_SW_NCF3:1;
      uint64_t EMAC_SB_END_CTRL:1;
      uint64_t RMII_MII_SEL:1;
      uint64_t reservedSpace0:3;
      uint64_t I3C0_CLK_MUX_SEL:1;
      uint64_t reservedSpace1:3;
      uint64_t VDD_HV_B_IO_CTRL_LATCH:1;
      uint64_t STANDBY_IO_CONFIG:1;
      uint64_t reservedSpace2:3;
      uint64_t SUPPLY_MON_EN:1;
      uint64_t SUPPLY_MON_SEL:3;
      uint64_t VSS_LV_ANMUX_EN:1;
      uint64_t VDD_HV_A_VLT_DVDR_EN:1;
      uint64_t VDD_HV_B_VLT_DVDR_EN:1;
      uint64_t VDD_1_5_VLT_DVDR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWF1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t DCM_SCAN_BYP_STDBY_EXT:1;
      uint64_t FIRC_TRIM_BYP_STDBY_EXT:1;
      uint64_t PMC_TRIM_RGM_DCF__BYP_STDBY_EXT:1;
      uint64_t SIRC_TRIM_BYP_STDBY_EXT:1;
      uint64_t reservedSpace1:1;
      uint64_t PMOS_CTRL_GPIO_DATA:1;
      uint64_t reservedSpace2:2;
      uint64_t SAI_MCLK2_SEL:1;
      uint64_t SUPPLY2_MON_EN:1;
      uint64_t SUPPLY2_MON_SEL:3;
      uint64_t HSE_GSKT_BYPASS:1;
      uint64_t reservedSpace3:4;
      uint64_t PGOOD_POLARITY:1;
      uint64_t reservedSpace4:2;
      uint64_t PLL1_LOL_RST_EN:1;
      uint64_t WKPU0_SRC_SELECT:1;
      uint64_t WKPU14_SRC_SELECT:1;
      uint64_t WKPU15_SRC_SELECT:1;
      uint64_t WKPU18_SRC_SELECT:1;
      uint64_t WKPU27_SRC_SELECT:1;
      uint64_t WKPU45_SRC_SELECT:1;
      uint64_t WKPU8_SRC_SELECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWF2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MAC_RX_CLK_MUX_BYPASS:2;
      uint64_t MAC_TX_CLK_MUX_BYPASS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWF3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MUX_MODE_EN_ADC0_S8:1;
      uint64_t MUX_MODE_EN_ADC0_S9:1;
      uint64_t MUX_MODE_EN_ADC1_S14:1;
      uint64_t MUX_MODE_EN_ADC1_S15:1;
      uint64_t MUX_MODE_EN_ADC1_S22:1;
      uint64_t MUX_MODE_EN_ADC1_S23:1;
      uint64_t reservedSpace1:2;
      uint64_t MUX_MODE_EN_ADC2_S8:1;
      uint64_t MUX_MODE_EN_ADC2_S9:1;
      uint64_t reservedSpace2:2;
      uint64_t GLITCH_FIL_TRG_IN0_BYP:1;
      uint64_t GLITCH_FIL_TRG_IN1_BYP:1;
      uint64_t GLITCH_FIL_TRG_IN2_BYP:1;
      uint64_t GLITCH_FIL_TRG_IN3_BYP:1;
      uint64_t CM7_0_CPUWAIT:1;
      uint64_t CM7_1_CPUWAIT:1;
      uint64_t CM7_2_CPUWAIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWF4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOOT_MODE:1;
      uint64_t BOOT_ADDRESS:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMRWF5;

  uint8_t res10[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_STAT0:1;
      uint64_t POR_WDG_STAT1:1;
      uint64_t POR_WDG_STAT2:1;
      uint64_t POR_WDG_STAT3:1;
      uint64_t POR_WDG_STAT4:1;
      uint64_t POR_WDG_STAT5:1;
      uint64_t POR_WDG_STAT6:1;
      uint64_t reservedSpace0:3;
      uint64_t POR_WDG_STAT10:1;
      uint64_t POR_WDG_STAT11:1;
      uint64_t reservedSpace1:2;
      uint64_t POR_WDG_STAT14:1;
      uint64_t reservedSpace2:2;
      uint64_t POR_WDG_STAT17:1;
      uint64_t reservedSpace3:2;
      uint64_t POR_WDG_STAT20:1;
      uint64_t reservedSpace4:8;
      uint64_t POR_WDG_STAT29:1;
      uint64_t POR_WDG_STAT30:1;
      uint64_t POR_WDG_STAT31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROPP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_STAT32:1;
      uint64_t reservedSpace0:2;
      uint64_t POR_WDG_STAT35:1;
      uint64_t POR_WDG_STAT36:1;
      uint64_t reservedSpace1:1;
      uint64_t POR_WDG_STAT38:1;
      uint64_t POR_WDG_STAT39:1;
      uint64_t POR_WDG_STAT40:1;
      uint64_t POR_WDG_STAT41:1;
      uint64_t reservedSpace2:6;
      uint64_t POR_WDG_STAT48:1;
      uint64_t reservedSpace3:3;
      uint64_t POR_WDG_STAT52:1;
      uint64_t reservedSpace4:8;
      uint64_t POR_WDG_STAT61:1;
      uint64_t POR_WDG_STAT62:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROPP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_STAT64:1;
      uint64_t reservedSpace0:2;
      uint64_t POR_WDG_STAT67:1;
      uint64_t POR_WDG_STAT68:1;
      uint64_t reservedSpace1:1;
      uint64_t POR_WDG_STAT70:1;
      uint64_t reservedSpace2:1;
      uint64_t POR_WDG_STAT72:1;
      uint64_t POR_WDG_STAT73:1;
      uint64_t POR_WDG_STAT74:1;
      uint64_t reservedSpace3:1;
      uint64_t POR_WDG_STAT76:1;
      uint64_t reservedSpace4:1;
      uint64_t POR_WDG_STAT78:1;
      uint64_t POR_WDG_STAT79:1;
      uint64_t POR_WDG_STAT80:1;
      uint64_t POR_WDG_STAT81:1;
      uint64_t POR_WDG_STAT82:1;
      uint64_t reservedSpace5:10;
      uint64_t POR_WDG_STAT93:1;
      uint64_t POR_WDG_STAT94:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROPP3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t POR_WDG_STAT96:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCMROPP4;

