iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define DCM_GPR (*(volatile struct DCM_GPR_tag *) 0x402ac200)

struct WKPU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t NOVF2:1;
      uint64_t NIF2:1;
      uint64_t reservedSpace1:6;
      uint64_t NOVF1:1;
      uint64_t NIF1:1;
      uint64_t reservedSpace2:6;
      uint64_t NOVF0:1;
      uint64_t NIF0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t NFE2:1;
      uint64_t NFEE2:1;
      uint64_t NREE2:1;
      uint64_t reservedSpace1:1;
      uint64_t NWRE2:1;
      uint64_t NDSS2:2;
      uint64_t NLOCK2:1;
      uint64_t NFE1:1;
      uint64_t NFEE1:1;
      uint64_t NREE1:1;
      uint64_t reservedSpace2:1;
      uint64_t NWRE1:1;
      uint64_t NDSS1:2;
      uint64_t NLOCK1:1;
      uint64_t NFE0:1;
      uint64_t NFEE0:1;
      uint64_t NREE0:1;
      uint64_t reservedSpace3:1;
      uint64_t NWRE0:1;
      uint64_t NDSS0:2;
      uint64_t NLOCK0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRER;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIREER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEEx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFEER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFER;

  uint8_t res3[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIF_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WISR_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIRE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRER_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WRER_64;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IREE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIREER_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFEEx_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFEER_64;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IFE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WIFER_64;

};

#define WKPU (*(volatile struct WKPU_tag *) 0x402b4000)

struct CMU_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:1;
      uint64_t FHH:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLLIE:1;
      uint64_t FHHIE:1;
      uint64_t FLLAIE:1;
      uint64_t FHHAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_0 (*(volatile struct CMU_0_tag *) 0x402bc000)

struct CMU_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:1;
      uint64_t FHH:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLLIE:1;
      uint64_t FHHIE:1;
      uint64_t FLLAIE:1;
      uint64_t FHHAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_3 (*(volatile struct CMU_3_tag *) 0x402bc060)

struct CMU_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:1;
      uint64_t FHH:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLLIE:1;
      uint64_t FHHIE:1;
      uint64_t FLLAIE:1;
      uint64_t FHHAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

