iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define CMU_4 (*(volatile struct CMU_4_tag *) 0x402bc080)

struct CMU_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LFREF:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLL:1;
      uint64_t FHH:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLLIE:1;
      uint64_t FHHIE:1;
      uint64_t FLLAIE:1;
      uint64_t FHHAIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_5 (*(volatile struct CMU_5_tag *) 0x402bc0a0)

struct CMU_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMC:1;
      uint64_t FMTO:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
      uint64_t reservedSpace1:3;
      uint64_t MET_CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_1 (*(volatile struct CMU_1_tag *) 0x402bc020)

struct CMU_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FME:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REF_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMC:1;
      uint64_t FMTO:1;
      uint64_t reservedSpace0:2;
      uint64_t RS:1;
      uint64_t reservedSpace1:3;
      uint64_t MET_CNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FMCIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IER;

};

#define CMU_2 (*(volatile struct CMU_2_tag *) 0x402bc040)

struct TSPC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRP1_EN:1;
      uint64_t GRP2_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP_EN;

  uint8_t res0[76];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBE0:1;
      uint64_t OBE1:1;
      uint64_t OBE2:1;
      uint64_t OBE3:1;
      uint64_t OBE4:1;
      uint64_t OBE5:1;
      uint64_t OBE6:1;
      uint64_t OBE7:1;
      uint64_t OBE8:1;
      uint64_t OBE9:1;
      uint64_t OBE10:1;
      uint64_t OBE11:1;
      uint64_t OBE12:1;
      uint64_t OBE13:1;
      uint64_t OBE14:1;
      uint64_t OBE15:1;
      uint64_t OBE16:1;
      uint64_t OBE17:1;
      uint64_t OBE18:1;
      uint64_t OBE19:1;
      uint64_t OBE20:1;
      uint64_t OBE21:1;
      uint64_t OBE22:1;
      uint64_t OBE23:1;
      uint64_t OBE24:1;
      uint64_t OBE25:1;
      uint64_t OBE26:1;
      uint64_t OBE27:1;
      uint64_t OBE28:1;
      uint64_t OBE29:1;
      uint64_t OBE30:1;
      uint64_t OBE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP1_OBE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBE32:1;
      uint64_t OBE33:1;
      uint64_t OBE34:1;
      uint64_t OBE35:1;
      uint64_t OBE36:1;
      uint64_t OBE37:1;
      uint64_t OBE38:1;
      uint64_t OBE39:1;
      uint64_t OBE40:1;
      uint64_t OBE41:1;
      uint64_t OBE42:1;
      uint64_t OBE43:1;
      uint64_t OBE44:1;
      uint64_t OBE45:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP1_OBE2;

  uint8_t res1[72];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBE0:1;
      uint64_t OBE1:1;
      uint64_t OBE2:1;
      uint64_t OBE3:1;
      uint64_t OBE4:1;
      uint64_t OBE5:1;
      uint64_t OBE6:1;
      uint64_t OBE7:1;
      uint64_t OBE8:1;
      uint64_t OBE9:1;
      uint64_t OBE10:1;
      uint64_t OBE11:1;
      uint64_t OBE12:1;
      uint64_t OBE13:1;
      uint64_t OBE14:1;
      uint64_t OBE15:1;
      uint64_t OBE16:1;
      uint64_t OBE17:1;
      uint64_t OBE18:1;
      uint64_t OBE19:1;
      uint64_t OBE20:1;
      uint64_t OBE21:1;
      uint64_t OBE22:1;
      uint64_t OBE23:1;
      uint64_t OBE24:1;
      uint64_t OBE25:1;
      uint64_t OBE26:1;
      uint64_t OBE27:1;
      uint64_t OBE28:1;
      uint64_t OBE29:1;
      uint64_t OBE30:1;
      uint64_t OBE31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP2_OBE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OBE32:1;
      uint64_t OBE33:1;
      uint64_t OBE34:1;
      uint64_t OBE35:1;
      uint64_t OBE36:1;
      uint64_t OBE37:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GRP2_OBE2;

};

#define TSPC (*(volatile struct TSPC_tag *) 0x402c4000)

struct SIRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t STANDBY_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISCELLANEOUS_IN;

};

#define SIRC (*(volatile struct SIRC_tag *) 0x402c8004)

struct SXOSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSCON:1;
      uint64_t reservedSpace0:15;
      uint64_t EOCV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SXOSC_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t OSC_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SXOSC_STAT;

