iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define SXOSC (*(volatile struct SXOSC_tag *) 0x402cc000)

struct FIRC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Status_Register;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STDBY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STDBY_ENABLE;

};

#define FIRC (*(volatile struct FIRC_tag *) 0x402d0004)

struct FXOSC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSCON:1;
      uint64_t reservedSpace0:1;
      uint64_t ALC_D:1;
      uint64_t reservedSpace1:1;
      uint64_t GM_SEL:4;
      uint64_t reservedSpace2:8;
      uint64_t EOCV:8;
      uint64_t COMP_EN:1;
      uint64_t reservedSpace3:6;
      uint64_t OSC_BYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t OSC_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

};

#define FXOSC (*(volatile struct FXOSC_tag *) 0x402d4000)

struct MC_CGM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDUR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFS_SDUR;

  uint8_t res0[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATE:8;
      uint64_t reservedSpace0:8;
      uint64_t INIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFS_DIVC8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVE:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFS_DIVE8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVS:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFS_DIVS8;

  uint8_t res1[668];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMPUP:1;
      uint64_t RAMPDOWN:1;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace0:20;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAMPUP:1;
      uint64_t RAMPDOWN:1;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace0:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace1:4;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:4;
      uint64_t reservedSpace1:11;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DC_6;

  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCTL:1;
      uint64_t reservedSpace0:30;
      uint64_t HHEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DIV_TRIG_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIGGER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DIV_TRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_0_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_1_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_1_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:1;
      uint64_t reservedSpace1:14;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_1_DC_0;

  uint8_t res3[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_1_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_2_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_2_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:1;
      uint64_t reservedSpace1:14;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_2_DC_0;

  uint8_t res4[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_2_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_3_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_3_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:2;
      uint64_t reservedSpace1:13;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_3_DC_0;

