iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res5[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_3_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_4_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_4_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:2;
      uint64_t reservedSpace1:13;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_4_DC_0;

  uint8_t res6[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_4_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CG:1;
      uint64_t FCG:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_5_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t GRIP:1;
      uint64_t CS:1;
      uint64_t reservedSpace1:6;
      uint64_t SELSTAT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_5_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_5_DC_0;

  uint8_t res7[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_5_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CG:1;
      uint64_t FCG:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_6_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t GRIP:1;
      uint64_t CS:1;
      uint64_t reservedSpace1:6;
      uint64_t SELSTAT:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_6_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_6_DC_0;

  uint8_t res8[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_6_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_7_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_7_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_7_DC_0;

  uint8_t res9[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_7_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_8_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_8_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_8_DC_0;

  uint8_t res10[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_8_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_9_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_9_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:6;
      uint64_t reservedSpace1:9;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_9_DC_0;

  uint8_t res11[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_9_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_10_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_10_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:3;
      uint64_t reservedSpace1:12;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_10_DC_0;

