iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res12[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_10_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CG:1;
      uint64_t FCG:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_11_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t GRIP:1;
      uint64_t CS:1;
      uint64_t reservedSpace1:6;
      uint64_t SELSTAT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_11_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:4;
      uint64_t reservedSpace1:11;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_11_DC_0;

  uint8_t res13[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_11_DIV_UPD_STAT;

  uint8_t res14[64];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_13_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_13_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:1;
      uint64_t reservedSpace1:14;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_13_DC_0;

  uint8_t res15[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_13_DIV_UPD_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:20;
      uint64_t SELCTL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_14_CSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t CLK_SW:1;
      uint64_t SAFE_SW:1;
      uint64_t reservedSpace1:12;
      uint64_t SWIP:1;
      uint64_t SWTRG:3;
      uint64_t reservedSpace2:4;
      uint64_t SELSTAT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_14_CSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:1;
      uint64_t reservedSpace1:14;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_14_DC_0;

  uint8_t res16[48];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MUX_14_DIV_UPD_STAT;

};

#define MC_CGM (*(volatile struct MC_CGM_tag *) 0x402d8000)

struct MC_ME_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL_KEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEST_RST:1;
      uint64_t FUNC_RST:1;
      uint64_t reservedSpace0:13;
      uint64_t STANDBY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE_CONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE_UPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE_UPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREV_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CIDX:3;
      uint64_t reservedSpace0:5;
      uint64_t PIDX:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAIN_COREID;

  uint8_t res0[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_PCONF;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCUD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_PUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_STAT;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t BLOCK3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_COFB0_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLOCK32:1;
      uint64_t BLOCK33:1;
      uint64_t BLOCK34:1;
      uint64_t BLOCK35:1;
      uint64_t BLOCK36:1;
      uint64_t reservedSpace0:1;
      uint64_t BLOCK38:1;
      uint64_t BLOCK39:1;
      uint64_t BLOCK40:1;
      uint64_t BLOCK41:1;
      uint64_t BLOCK42:1;
      uint64_t reservedSpace1:1;
      uint64_t BLOCK44:1;
      uint64_t BLOCK45:1;
      uint64_t BLOCK46:1;
      uint64_t BLOCK47:1;
      uint64_t BLOCK48:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_COFB1_STAT;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t REQ3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_COFB0_CLKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ32:1;
      uint64_t REQ33:1;
      uint64_t REQ34:1;
      uint64_t REQ35:1;
      uint64_t REQ36:1;
      uint64_t reservedSpace0:1;
      uint64_t REQ38:1;
      uint64_t REQ39:1;
      uint64_t REQ40:1;
      uint64_t REQ41:1;
      uint64_t REQ42:1;
      uint64_t reservedSpace1:1;
      uint64_t REQ44:1;
      uint64_t REQ45:1;
      uint64_t REQ46:1;
      uint64_t REQ47:1;
      uint64_t REQ48:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN0_COFB1_CLKEN;

