iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res12[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t REQ4:1;
      uint64_t REQ5:1;
      uint64_t REQ6:1;
      uint64_t REQ7:1;
      uint64_t REQ8:1;
      uint64_t REQ9:1;
      uint64_t REQ10:1;
      uint64_t REQ11:1;
      uint64_t REQ12:1;
      uint64_t REQ13:1;
      uint64_t REQ14:1;
      uint64_t REQ15:1;
      uint64_t REQ16:1;
      uint64_t REQ17:1;
      uint64_t REQ18:1;
      uint64_t REQ19:1;
      uint64_t REQ20:1;
      uint64_t REQ21:1;
      uint64_t REQ22:1;
      uint64_t REQ23:1;
      uint64_t REQ24:1;
      uint64_t reservedSpace1:2;
      uint64_t REQ27:1;
      uint64_t REQ28:1;
      uint64_t REQ29:1;
      uint64_t REQ30:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_COFB0_CLKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t REQ33:1;
      uint64_t reservedSpace1:1;
      uint64_t REQ35:1;
      uint64_t REQ36:1;
      uint64_t REQ37:1;
      uint64_t REQ38:1;
      uint64_t REQ39:1;
      uint64_t REQ40:1;
      uint64_t REQ41:1;
      uint64_t REQ42:1;
      uint64_t reservedSpace2:4;
      uint64_t REQ47:1;
      uint64_t REQ48:1;
      uint64_t reservedSpace3:2;
      uint64_t REQ51:1;
      uint64_t reservedSpace4:3;
      uint64_t REQ55:1;
      uint64_t reservedSpace5:1;
      uint64_t REQ57:1;
      uint64_t REQ58:1;
      uint64_t reservedSpace6:3;
      uint64_t REQ62:1;
      uint64_t REQ63:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_COFB1_CLKEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ64:1;
      uint64_t reservedSpace0:2;
      uint64_t REQ67:1;
      uint64_t REQ68:1;
      uint64_t REQ69:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRTN2_COFB2_CLKEN;

};

#define MC_ME (*(volatile struct MC_ME_tag *) 0x402dc000)

struct PLL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t PLLPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOCK:1;
      uint64_t LOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFI:8;
      uint64_t reservedSpace0:4;
      uint64_t RDIV:3;
      uint64_t reservedSpace1:10;
      uint64_t ODIV2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLDV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STEPNO:11;
      uint64_t reservedSpace0:5;
      uint64_t STEPSIZE:10;
      uint64_t reservedSpace1:3;
      uint64_t SPREADCTL:1;
      uint64_t SSCGBYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLFM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFN:15;
      uint64_t reservedSpace0:13;
      uint64_t SDM3:1;
      uint64_t SDM2:1;
      uint64_t SDMEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLFD;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t ULKCTL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCAL2;

  uint8_t res1[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:8;
      uint64_t reservedSpace1:7;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLODIV__0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:8;
      uint64_t reservedSpace1:7;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLODIV__1;

};

#define PLL (*(volatile struct PLL_tag *) 0x402e0000)

struct PLL_AUX_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:31;
      uint64_t PLLPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t LOCK:1;
      uint64_t LOL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFI:8;
      uint64_t reservedSpace0:4;
      uint64_t RDIV:3;
      uint64_t reservedSpace1:10;
      uint64_t ODIV2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLDV;

  uint8_t res0[116];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:5;
      uint64_t reservedSpace1:10;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLODIV__0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:5;
      uint64_t reservedSpace1:10;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLODIV__1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DIV:5;
      uint64_t reservedSpace1:10;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PLLODIV__2;

};

#define PLL_AUX (*(volatile struct PLL_AUX_tag *) 0x402e4000)

struct PMC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HVDAF:1;
      uint64_t HVDBF:1;
      uint64_t HVD25F:1;
      uint64_t HVD11F:1;
      uint64_t LVD5AF:1;
      uint64_t reservedSpace0:1;
      uint64_t HVD15F:1;
      uint64_t reservedSpace1:1;
      uint64_t HVDAS:1;
      uint64_t HVDBS:1;
      uint64_t HVD25S:1;
      uint64_t HVD11S:1;
      uint64_t LVD5AS:1;
      uint64_t reservedSpace2:1;
      uint64_t HVD15S:1;
      uint64_t reservedSpace3:1;
      uint64_t LVRAF:1;
      uint64_t LVRALPF:1;
      uint64_t LVRBF:1;
      uint64_t LVRBLPF:1;
      uint64_t LVR25F:1;
      uint64_t LVR25LPF:1;
      uint64_t LVR11F:1;
      uint64_t LVR11LPF:1;
      uint64_t GNG25OSCF:1;
      uint64_t GNG11OSCF:1;
      uint64_t GNG25OSC2F:1;
      uint64_t GNG11OSC2F:1;
      uint64_t reservedSpace4:3;
      uint64_t PORF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LVSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMEN:1;
      uint64_t LMBCTLEN:1;
      uint64_t FASTREC:1;
      uint64_t LPM25EN:1;
      uint64_t LVRBLPEN:1;
      uint64_t reservedSpace0:2;
      uint64_t LMSMPSEN:1;
      uint64_t HVDIE:1;
      uint64_t LVDIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG:4;
      uint64_t LPM15EN:1;
      uint64_t DITHERCFG:2;
      uint64_t DITHEREN:1;
      uint64_t PERIOD:5;
      uint64_t reservedSpace0:3;
      uint64_t ONTIME3V:5;
      uint64_t reservedSpace1:2;
      uint64_t PGATES:1;
      uint64_t ONTIME5V:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPSCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMFEAT:1;
      uint64_t reservedSpace0:15;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

