iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define PMC (*(volatile struct PMC_tag *) 0x402e8000)

struct FLASH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EHV:1;
      uint64_t reservedSpace0:3;
      uint64_t ERS:1;
      uint64_t ESS:1;
      uint64_t reservedSpace1:2;
      uint64_t PGM:1;
      uint64_t reservedSpace2:3;
      uint64_t WDIE:1;
      uint64_t reservedSpace3:2;
      uint64_t PECIE:1;
      uint64_t PEID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RE:1;
      uint64_t reservedSpace0:7;
      uint64_t TSPELOCK:1;
      uint64_t EPEG:1;
      uint64_t reservedSpace1:2;
      uint64_t WDI:1;
      uint64_t reservedSpace2:1;
      uint64_t PEG:1;
      uint64_t DONE:1;
      uint64_t PES:1;
      uint64_t PEP:1;
      uint64_t reservedSpace3:2;
      uint64_t RWE:1;
      uint64_t reservedSpace4:3;
      uint64_t RRE:1;
      uint64_t RVE:1;
      uint64_t reservedSpace5:2;
      uint64_t EEE:1;
      uint64_t AEE:1;
      uint64_t SBC:1;
      uint64_t EER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t n256K:2;
      uint64_t reservedSpace1:6;
      uint64_t n512K:2;
      uint64_t reservedSpace2:5;
      uint64_t n1M:3;
      uint64_t reservedSpace3:5;
      uint64_t n2M:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCRE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RWSC:5;
      uint64_t reservedSpace1:2;
      uint64_t RWSL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ADDR:18;
      uint64_t A0:1;
      uint64_t A1:1;
      uint64_t A2:1;
      uint64_t reservedSpace1:2;
      uint64_t A5:1;
      uint64_t reservedSpace2:6;
      uint64_t SAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t PEADDR:14;
      uint64_t PEA0:1;
      uint64_t PEA1:1;
      uint64_t PEA2:1;
      uint64_t PEA3:1;
      uint64_t PEA4:1;
      uint64_t PEA5:1;
      uint64_t reservedSpace1:6;
      uint64_t PEASAD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEADR;

  uint8_t res0[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPELOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPELOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSPELOCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSPELOCK;

  uint8_t res1[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSPELOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XSPELOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XSSPELOCK:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XSSPELOCK;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AID:1;
      uint64_t AIE:1;
      uint64_t AIS:1;
      uint64_t reservedSpace0:1;
      uint64_t MRV:1;
      uint64_t MRE:1;
      uint64_t AISUS:1;
      uint64_t reservedSpace1:1;
      uint64_t AIBPE:1;
      uint64_t NAIBP:1;
      uint64_t reservedSpace2:2;
      uint64_t EIE:1;
      uint64_t EDIE:1;
      uint64_t AEIE:1;
      uint64_t RRIE:1;
      uint64_t reservedSpace3:14;
      uint64_t SBCE:1;
      uint64_t UTE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UM9;

  uint8_t res3[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDATAC:8;
      uint64_t reservedSpace0:16;
      uint64_t ED0:1;
      uint64_t ED1:1;
      uint64_t ED2:1;
      uint64_t ED3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDDATAC:8;
      uint64_t reservedSpace0:16;
      uint64_t EDD0:1;
      uint64_t EDD1:1;
      uint64_t EDD2:1;
      uint64_t EDD3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UD5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AEI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AEI:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t XEHV:1;
      uint64_t reservedSpace0:7;
      uint64_t XPGM:1;
      uint64_t XEPEG:1;
      uint64_t reservedSpace1:1;
      uint64_t XWDIE:1;
      uint64_t XWDI:1;
      uint64_t XDOK:1;
      uint64_t XPEG:1;
      uint64_t XDONE:1;
      uint64_t XPEID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XMCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t XPEADDR:14;
      uint64_t XPEA0:1;
      uint64_t XPEA1:1;
      uint64_t XPEA2:1;
      uint64_t XPEA3:1;
      uint64_t XPEA4:1;
      uint64_t XPEA5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) XPEADR;

