iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA_31;

};

#define FLASH (*(volatile struct FLASH_tag *) 0x402ec000)

struct CAN_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAXMB:7;
      uint64_t reservedSpace0:1;
      uint64_t IDAM:2;
      uint64_t reservedSpace1:1;
      uint64_t FDEN:1;
      uint64_t AEN:1;
      uint64_t LPRIOEN:1;
      uint64_t reservedSpace2:1;
      uint64_t DMA:1;
      uint64_t IRMQ:1;
      uint64_t SRXDIS:1;
      uint64_t reservedSpace3:2;
      uint64_t LPMACK:1;
      uint64_t WRNEN:1;
      uint64_t reservedSpace4:1;
      uint64_t SUPV:1;
      uint64_t FRZACK:1;
      uint64_t SOFTRST:1;
      uint64_t reservedSpace5:1;
      uint64_t NOTRDY:1;
      uint64_t HALT:1;
      uint64_t RFEN:1;
      uint64_t FRZ:1;
      uint64_t MDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROPSEG:3;
      uint64_t LOM:1;
      uint64_t LBUF:1;
      uint64_t TSYN:1;
      uint64_t BOFFREC:1;
      uint64_t SMP:1;
      uint64_t reservedSpace0:2;
      uint64_t RWRNMSK:1;
      uint64_t TWRNMSK:1;
      uint64_t LPB:1;
      uint64_t reservedSpace1:1;
      uint64_t ERRMSK:1;
      uint64_t BOFFMSK:1;
      uint64_t PSEG2:3;
      uint64_t PSEG1:3;
      uint64_t RJW:2;
      uint64_t PRESDIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER;

