iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res3[352];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t NCEFAFRZ:1;
      uint64_t ECCDIS:1;
      uint64_t RERRDIS:1;
      uint64_t reservedSpace1:3;
      uint64_t EXTERRIE:1;
      uint64_t FAERRIE:1;
      uint64_t HAERRIE:1;
      uint64_t CEI_MSK:1;
      uint64_t reservedSpace2:1;
      uint64_t FANCEI_MSK:1;
      uint64_t HANCEI_MSK:1;
      uint64_t reservedSpace3:11;
      uint64_t ECRWRDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MECR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INJADDR_L:2;
      uint64_t INJADDR_H:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRIAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DFLIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRIDPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFLIP0:5;
      uint64_t reservedSpace0:3;
      uint64_t PFLIP1:5;
      uint64_t reservedSpace1:3;
      uint64_t PFLIP2:5;
      uint64_t reservedSpace2:3;
      uint64_t PFLIP3:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRIPPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRADDR:14;
      uint64_t reservedSpace0:2;
      uint64_t SAID:3;
      uint64_t reservedSpace1:5;
      uint64_t NCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RERRAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RERRDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYND0:5;
      uint64_t reservedSpace0:2;
      uint64_t BE0:1;
      uint64_t SYND1:5;
      uint64_t reservedSpace1:2;
      uint64_t BE1:1;
      uint64_t SYND2:5;
      uint64_t reservedSpace2:2;
      uint64_t BE2:1;
      uint64_t SYND3:5;
      uint64_t reservedSpace3:2;
      uint64_t BE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RERRSYNR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CEIOF:1;
      uint64_t reservedSpace0:1;
      uint64_t FANCEIOF:1;
      uint64_t HANCEIOF:1;
      uint64_t reservedSpace1:12;
      uint64_t CEIF:1;
      uint64_t reservedSpace2:1;
      uint64_t FANCEIF:1;
      uint64_t HANCEIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRSR;

  uint8_t res4[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENPRESDIV:10;
      uint64_t reservedSpace0:6;
      uint64_t EDPRESDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NTSEG1:8;
      uint64_t reservedSpace0:4;
      uint64_t NTSEG2:7;
      uint64_t reservedSpace1:3;
      uint64_t NRJW:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTSEG1:5;
      uint64_t reservedSpace0:7;
      uint64_t DTSEG2:4;
      uint64_t reservedSpace1:6;
      uint64_t DRJW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EDCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETDCVAL:8;
      uint64_t reservedSpace0:7;
      uint64_t ETDCFAIL:1;
      uint64_t ETDCOFF:7;
      uint64_t reservedSpace1:7;
      uint64_t TDMDIS:1;
      uint64_t ETDCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ETDC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDCVAL:6;
      uint64_t reservedSpace0:2;
      uint64_t TDCOFF:5;
      uint64_t reservedSpace1:1;
      uint64_t TDCFAIL:1;
      uint64_t TDCEN:1;
      uint64_t MBDSR0:2;
      uint64_t reservedSpace2:1;
      uint64_t MBDSR1:2;
      uint64_t reservedSpace3:10;
      uint64_t FDRATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPSEG2:3;
      uint64_t reservedSpace0:2;
      uint64_t FPSEG1:3;
      uint64_t reservedSpace1:2;
      uint64_t FPROPSEG:5;
      uint64_t reservedSpace2:1;
      uint64_t FRJW:3;
      uint64_t reservedSpace3:1;
      uint64_t FPRESDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCBT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FD_TXCRC:21;
      uint64_t reservedSpace0:3;
      uint64_t FD_MBCRC:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDCRC;

  uint8_t res5[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_43;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_44;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_45;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_46;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_47;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_48;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_49;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_50;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_51;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_52;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_53;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_54;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_55;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_56;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_57;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_58;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_59;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_60;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_61;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_62;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HR_TIME_STAMP_63;

