iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define CAN_7 (*(volatile struct CAN_7_tag *) 0x40320000)

struct FLEXIO_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTER:8;
      uint64_t TIMER:8;
      uint64_t PIN:8;
      uint64_t TRIGGER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLEXEN:1;
      uint64_t SWRST:1;
      uint64_t FASTACC:1;
      uint64_t reservedSpace0:27;
      uint64_t DBGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDI:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTERR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMSTAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSIE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTSIEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEIE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTEIEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEIE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMIEN;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSDE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTSDEN;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSDE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMERSDEN;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTSTATE;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ETSF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRGSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGIEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSIE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINIEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINREN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINFEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINOUTD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINOUTE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTDIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINOUTDIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTCLR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINOUTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTSET:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINOUTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUTTOG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINOUTTOG;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMOD:3;
      uint64_t reservedSpace0:4;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:5;
      uint64_t TIMPOL:1;
      uint64_t TIMSEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCTL_7;

  uint8_t res6[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
      uint64_t LATST:1;
      uint64_t reservedSpace2:2;
      uint64_t SSIZE:1;
      uint64_t reservedSpace3:3;
      uint64_t PWIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
      uint64_t LATST:1;
      uint64_t reservedSpace2:2;
      uint64_t SSIZE:1;
      uint64_t reservedSpace3:3;
      uint64_t PWIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
      uint64_t LATST:1;
      uint64_t reservedSpace2:2;
      uint64_t SSIZE:1;
      uint64_t reservedSpace3:3;
      uint64_t PWIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
      uint64_t LATST:1;
      uint64_t reservedSpace2:2;
      uint64_t SSIZE:1;
      uint64_t reservedSpace3:3;
      uint64_t PWIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCFG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
      uint64_t LATST:1;
      uint64_t reservedSpace2:2;
      uint64_t SSIZE:1;
      uint64_t reservedSpace3:3;
      uint64_t PWIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCFG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
      uint64_t LATST:1;
      uint64_t reservedSpace2:2;
      uint64_t SSIZE:1;
      uint64_t reservedSpace3:3;
      uint64_t PWIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCFG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
      uint64_t LATST:1;
      uint64_t reservedSpace2:2;
      uint64_t SSIZE:1;
      uint64_t reservedSpace3:3;
      uint64_t PWIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCFG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SSTART:2;
      uint64_t reservedSpace0:2;
      uint64_t SSTOP:2;
      uint64_t reservedSpace1:2;
      uint64_t INSRC:1;
      uint64_t LATST:1;
      uint64_t reservedSpace2:2;
      uint64_t SSIZE:1;
      uint64_t reservedSpace3:3;
      uint64_t PWIDTH:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTCFG_7;

