iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res7[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUF_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUF_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUF_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUF_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUF_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUF_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUF_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUF:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUF_7;

  uint8_t res8[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBIS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBIS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBIS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBIS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBIS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBIS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBIS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBIS_7;

  uint8_t res9[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBYS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBYS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBYS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBYS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBYS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBYS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBYS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBYS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBYS_7;

  uint8_t res10[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBBS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBBS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBBS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBBS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBBS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBBS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBBS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFBBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFBBS_7;

  uint8_t res11[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:3;
      uint64_t reservedSpace0:2;
      uint64_t ONETIM:1;
      uint64_t PININS:1;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:3;
      uint64_t reservedSpace0:2;
      uint64_t ONETIM:1;
      uint64_t PININS:1;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTL_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:3;
      uint64_t reservedSpace0:2;
      uint64_t ONETIM:1;
      uint64_t PININS:1;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTL_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:3;
      uint64_t reservedSpace0:2;
      uint64_t ONETIM:1;
      uint64_t PININS:1;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTL_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:3;
      uint64_t reservedSpace0:2;
      uint64_t ONETIM:1;
      uint64_t PININS:1;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTL_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:3;
      uint64_t reservedSpace0:2;
      uint64_t ONETIM:1;
      uint64_t PININS:1;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTL_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:3;
      uint64_t reservedSpace0:2;
      uint64_t ONETIM:1;
      uint64_t PININS:1;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTL_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMOD:3;
      uint64_t reservedSpace0:2;
      uint64_t ONETIM:1;
      uint64_t PININS:1;
      uint64_t PINPOL:1;
      uint64_t PINSEL:5;
      uint64_t reservedSpace1:3;
      uint64_t PINCFG:2;
      uint64_t reservedSpace2:4;
      uint64_t TRGSRC:1;
      uint64_t TRGPOL:1;
      uint64_t TRGSEL:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCTL_7;

  uint8_t res12[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:3;
      uint64_t reservedSpace6:1;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:3;
      uint64_t reservedSpace6:1;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:3;
      uint64_t reservedSpace6:1;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:3;
      uint64_t reservedSpace6:1;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:3;
      uint64_t reservedSpace6:1;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:3;
      uint64_t reservedSpace6:1;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:3;
      uint64_t reservedSpace6:1;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t TSTART:1;
      uint64_t reservedSpace1:2;
      uint64_t TSTOP:2;
      uint64_t reservedSpace2:2;
      uint64_t TIMENA:3;
      uint64_t reservedSpace3:1;
      uint64_t TIMDIS:3;
      uint64_t reservedSpace4:1;
      uint64_t TIMRST:3;
      uint64_t reservedSpace5:1;
      uint64_t TIMDEC:3;
      uint64_t reservedSpace6:1;
      uint64_t TIMOUT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG_7;

  uint8_t res13[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCMP_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCMP_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCMP_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCMP_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCMP_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCMP_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCMP_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCMP_7;

  uint8_t res14[352];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNBS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNBS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNBS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNBS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNBS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNBS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNBS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNBS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNBS_7;

  uint8_t res15[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFHWS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFHWS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFHWS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFHWS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFHWS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFHWS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFHWS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFHWS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFHWS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFHWS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFHWS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFHWS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFHWS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFHWS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFHWS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFHWS_7;

  uint8_t res16[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNIS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNIS_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNIS_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNIS_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNIS_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNIS_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNIS_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SHIFTBUFNIS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHIFTBUFNIS_7;

