iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define MU_1__MUB (*(volatile struct MU_1__MUB_tag *) 0x404ec000)

struct JDC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t JOUT_IEN:1;
      uint64_t reservedSpace0:15;
      uint64_t JIN_IEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t JOUT_INT:1;
      uint64_t reservedSpace0:1;
      uint64_t JOUT_RDY:1;
      uint64_t reservedSpace1:13;
      uint64_t JIN_INT:1;
      uint64_t reservedSpace2:1;
      uint64_t JIN_RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JOUT_IPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Data:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JIN_IPS;

};

#define JDC (*(volatile struct JDC_tag *) 0x40394000)

struct CONFIGURATION_GPR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t EDB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_REG0;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUADSPI_SDID_PCTL:1;
      uint64_t reservedSpace0:1;
      uint64_t EMAC_CLOCK_GATE:1;
      uint64_t reservedSpace1:1;
      uint64_t FLEXIO_CLOCK_GATE:1;
      uint64_t SAI_SDID_PCTL:1;
      uint64_t reservedSpace2:25;
      uint64_t HL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_REG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t SECURE_SIZE:16;
      uint64_t reservedSpace1:9;
      uint64_t SOFT_LOCK:1;
      uint64_t HARD_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RAMPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t SECURE_SIZE:8;
      uint64_t reservedSpace1:9;
      uint64_t SOFT_LOCK:1;
      uint64_t HARD_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_CFPRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t SECURE_SIZE:8;
      uint64_t reservedSpace1:9;
      uint64_t SOFT_LOCK:1;
      uint64_t HARD_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_CFPRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t SECURE_SIZE:8;
      uint64_t reservedSpace1:9;
      uint64_t SOFT_LOCK:1;
      uint64_t HARD_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_DFPR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t PE_LOCK_BLOCK_0:1;
      uint64_t PE_LOCK_BLOCK_1:1;
      uint64_t PE_LOCK_BLOCK_2:1;
      uint64_t PE_LOCK_BLOCK_3:1;
      uint64_t PE_LOCK_BLOCK_4:1;
      uint64_t reservedSpace1:1;
      uint64_t PE_LOCK_UTEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_PE_LOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVERT_VALUE_RAMPR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RAMPR_ALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVERT_VALUE_CFPRAB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_CFPRL_ALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVERT_VALUE_CFPRP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_CFPRH_ALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVERT_VALUE_DFPR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_DFPR_ALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIRC_DIV_SEL:2;
      uint64_t reservedSpace0:27;
      uint64_t APP_CORE_ACC:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_REG_GPR;

  uint8_t res2[88];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GMID:6;
      uint64_t ADDRESS_SIZE:8;
      uint64_t DXACP:3;
      uint64_t GMID_VLD:1;
      uint64_t VLD:1;
      uint64_t reservedSpace0:11;
      uint64_t SOFT_LOCK:1;
      uint64_t HARD_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPI_SFP_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVERT_QSPI_SFP_TRL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPI_SFP_CTRL_ALT;

};

#define CONFIGURATION_GPR (*(volatile struct CONFIGURATION_GPR_tag *) 0x4039c01c)

struct STCU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RUNSW:1;
      uint64_t reservedSpace0:7;
      uint64_t LBSWPLLEN:1;
      uint64_t MBSWPLLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RUNSW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SKC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SKC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_CFG:3;
      uint64_t reservedSpace0:5;
      uint64_t WRP:1;
      uint64_t reservedSpace1:4;
      uint64_t LB_DELAY:8;
      uint64_t PTR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDGEOC:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDG;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RFSF:1;
      uint64_t UFSF:1;
      uint64_t reservedSpace1:6;
      uint64_t INVPSW:1;
      uint64_t ENGESW:1;
      uint64_t reservedSpace2:1;
      uint64_t WDTOSW:1;
      uint64_t LOCKESW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INVPUFM:1;
      uint64_t ENGEUFM:1;
      uint64_t reservedSpace0:1;
      uint64_t WDTOUFM:1;
      uint64_t LOCKEUFM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERR_FM;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBSSW0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBSSW0;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBESW0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBESW0;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBUFM0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LBUFM0;

  uint8_t res5[140];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBSSW0:1;
      uint64_t MBSSW1:1;
      uint64_t MBSSW2:1;
      uint64_t MBSSW3:1;
      uint64_t MBSSW4:1;
      uint64_t MBSSW5:1;
      uint64_t MBSSW6:1;
      uint64_t MBSSW7:1;
      uint64_t MBSSW8:1;
      uint64_t MBSSW9:1;
      uint64_t MBSSW10:1;
      uint64_t MBSSW11:1;
      uint64_t MBSSW12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBSSW0;

  uint8_t res6[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBESW0:1;
      uint64_t MBESW1:1;
      uint64_t MBESW2:1;
      uint64_t MBESW3:1;
      uint64_t MBESW4:1;
      uint64_t MBESW5:1;
      uint64_t MBESW6:1;
      uint64_t MBESW7:1;
      uint64_t MBESW8:1;
      uint64_t MBESW9:1;
      uint64_t MBESW10:1;
      uint64_t MBESW11:1;
      uint64_t MBESW12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBESW0;

