iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res7[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MBUFM0:1;
      uint64_t MBUFM1:1;
      uint64_t MBUFM2:1;
      uint64_t MBUFM3:1;
      uint64_t MBUFM4:1;
      uint64_t MBUFM5:1;
      uint64_t MBUFM6:1;
      uint64_t MBUFM7:1;
      uint64_t MBUFM8:1;
      uint64_t MBUFM9:1;
      uint64_t MBUFM10:1;
      uint64_t MBUFM11:1;
      uint64_t MBUFM12:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MBUFM0;

  uint8_t res8[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CWS:6;
      uint64_t reservedSpace0:2;
      uint64_t SCEN_ON:4;
      uint64_t SCEN_OFF:4;
      uint64_t SHS:3;
      uint64_t reservedSpace1:2;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCS:26;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_PCS0;

  uint8_t res9[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRELSW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRESWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISREHSW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRLSW0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MISRRSWx:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LB_MISRRHSW0;

  uint8_t res10[8144];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALGOSEL0:1;
      uint64_t ALGOSEL1:1;
      uint64_t ALGOSEL2:1;
      uint64_t ALGOSEL3:1;
      uint64_t ALGOSEL4:1;
      uint64_t ALGOSEL5:1;
      uint64_t ALGOSEL6:1;
      uint64_t ALGOSEL7:1;
      uint64_t ALGOSEL8:1;
      uint64_t ALGOSEL9:1;
      uint64_t ALGOSEL10:1;
      uint64_t ALGOSEL11:1;
      uint64_t ALGOSEL12:1;
      uint64_t ALGOSEL13:1;
      uint64_t ALGOSEL14:1;
      uint64_t ALGOSEL15:1;
      uint64_t ALGOSEL16:1;
      uint64_t ALGOSEL17:1;
      uint64_t ALGOSEL18:1;
      uint64_t ALGOSEL19:1;
      uint64_t ALGOSEL20:1;
      uint64_t ALGOSEL21:1;
      uint64_t ALGOSEL22:1;
      uint64_t ALGOSEL23:1;
      uint64_t ALGOSEL24:1;
      uint64_t ALGOSEL25:1;
      uint64_t ALGOSEL26:1;
      uint64_t ALGOSEL27:1;
      uint64_t ALGOSEL28:1;
      uint64_t ALGOSEL29:1;
      uint64_t ALGOSEL30:1;
      uint64_t ALGOSEL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALGOSEL;

  uint8_t res11[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STGGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BSTART0:1;
      uint64_t BSTART1:1;
      uint64_t BSTART2:1;
      uint64_t BSTART3:1;
      uint64_t BSTART4:1;
      uint64_t BSTART5:1;
      uint64_t BSTART6:1;
      uint64_t BSTART7:1;
      uint64_t BSTART8:1;
      uint64_t BSTART9:1;
      uint64_t BSTART10:1;
      uint64_t BSTART11:1;
      uint64_t BSTART12:1;
      uint64_t BSTART13:1;
      uint64_t BSTART14:1;
      uint64_t BSTART15:1;
      uint64_t BSTART16:1;
      uint64_t BSTART17:1;
      uint64_t BSTART18:1;
      uint64_t BSTART19:1;
      uint64_t BSTART20:1;
      uint64_t BSTART21:1;
      uint64_t BSTART22:1;
      uint64_t BSTART23:1;
      uint64_t BSTART24:1;
      uint64_t BSTART25:1;
      uint64_t BSTART26:1;
      uint64_t BSTART27:1;
      uint64_t BSTART28:1;
      uint64_t BSTART29:1;
      uint64_t BSTART30:1;
      uint64_t BSTART31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BSTART;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:20;
      uint64_t BSEL:1;
      uint64_t PTR:10;
      uint64_t CSM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MB_CTRL12;

