iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define LPUART_14 (*(volatile struct LPUART_14_tag *) 0x404a4000)

struct LPUART_15_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXFIFO:8;
      uint64_t RXFIFO:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRGSEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PINCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SBR:13;
      uint64_t SBNS:1;
      uint64_t RXEDGIE:1;
      uint64_t LBKDIE:1;
      uint64_t RESYNCDIS:1;
      uint64_t BOTHEDGE:1;
      uint64_t MATCFG:2;
      uint64_t reservedSpace0:1;
      uint64_t RDMAE:1;
      uint64_t reservedSpace1:1;
      uint64_t TDMAE:1;
      uint64_t OSR:5;
      uint64_t M10:1;
      uint64_t MAEN2:1;
      uint64_t MAEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAUD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LBKFE:1;
      uint64_t AME:1;
      uint64_t reservedSpace0:12;
      uint64_t MA2F:1;
      uint64_t MA1F:1;
      uint64_t PF:1;
      uint64_t FE:1;
      uint64_t NF:1;
      uint64_t OR:1;
      uint64_t IDLE:1;
      uint64_t RDRF:1;
      uint64_t TC:1;
      uint64_t TDRE:1;
      uint64_t RAF:1;
      uint64_t LBKDE:1;
      uint64_t BRK13:1;
      uint64_t RWUID:1;
      uint64_t RXINV:1;
      uint64_t MSBF:1;
      uint64_t RXEDGIF:1;
      uint64_t LBKDIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PT:1;
      uint64_t PE:1;
      uint64_t ILT:1;
      uint64_t WAKE:1;
      uint64_t M:1;
      uint64_t RSRC:1;
      uint64_t DOZEEN:1;
      uint64_t LOOPS:1;
      uint64_t IDLECFG:3;
      uint64_t M7:1;
      uint64_t reservedSpace0:2;
      uint64_t MA2IE:1;
      uint64_t MA1IE:1;
      uint64_t SBK:1;
      uint64_t RWU:1;
      uint64_t RE:1;
      uint64_t TE:1;
      uint64_t ILIE:1;
      uint64_t RIE:1;
      uint64_t TCIE:1;
      uint64_t TIE:1;
      uint64_t PEIE:1;
      uint64_t FEIE:1;
      uint64_t NEIE:1;
      uint64_t ORIE:1;
      uint64_t TXINV:1;
      uint64_t TXDIR:1;
      uint64_t R9T8:1;
      uint64_t R8T9:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t R0T0:1;
      uint64_t R1T1:1;
      uint64_t R2T2:1;
      uint64_t R3T3:1;
      uint64_t R4T4:1;
      uint64_t R5T5:1;
      uint64_t R6T6:1;
      uint64_t R7T7:1;
      uint64_t R8T8:1;
      uint64_t R9T9:1;
      uint64_t LINBRK:1;
      uint64_t IDLINE:1;
      uint64_t RXEMPT:1;
      uint64_t FRETSC:1;
      uint64_t PARITYE:1;
      uint64_t NOISY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MA1:10;
      uint64_t reservedSpace0:6;
      uint64_t MA2:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCTSE:1;
      uint64_t TXRTSE:1;
      uint64_t TXRTSPOL:1;
      uint64_t RXRTSE:1;
      uint64_t TXCTSC:1;
      uint64_t TXCTSSRC:1;
      uint64_t reservedSpace0:2;
      uint64_t RTSWATER:2;
      uint64_t reservedSpace1:6;
      uint64_t TNP:2;
      uint64_t IREN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXFIFOSIZE:3;
      uint64_t RXFE:1;
      uint64_t TXFIFOSIZE:3;
      uint64_t TXFE:1;
      uint64_t RXUFE:1;
      uint64_t TXOFE:1;
      uint64_t RXIDEN:3;
      uint64_t reservedSpace0:1;
      uint64_t RXFLUSH:1;
      uint64_t TXFLUSH:1;
      uint64_t RXUF:1;
      uint64_t TXOF:1;
      uint64_t reservedSpace1:4;
      uint64_t RXEMPT:1;
      uint64_t TXEMPT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXWATER:2;
      uint64_t reservedSpace0:6;
      uint64_t TXCOUNT:3;
      uint64_t reservedSpace1:5;
      uint64_t RXWATER:2;
      uint64_t reservedSpace2:6;
      uint64_t RXCOUNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WATER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATARO;

};

#define LPUART_15 (*(volatile struct LPUART_15_tag *) 0x404a8000)

struct QUADSPI_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWRSTSD:1;
      uint64_t SWRSTHD:1;
      uint64_t reservedSpace0:2;
      uint64_t DQS_OUT_EN:1;
      uint64_t reservedSpace1:3;
      uint64_t VAR_LAT_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t CLR_RXF:1;
      uint64_t CLR_TXF:1;
      uint64_t DLPEN:1;
      uint64_t reservedSpace3:1;
      uint64_t MDIS:1;
      uint64_t reservedSpace4:1;
      uint64_t ISD2FA:1;
      uint64_t ISD3FA:1;
      uint64_t reservedSpace5:6;
      uint64_t DQS_FA_SEL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATSZ:16;
      uint64_t reservedSpace0:6;
      uint64_t ARB_LOCK:1;
      uint64_t ARB_UNLOCK:1;
      uint64_t SEQID:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCSS:4;
      uint64_t reservedSpace0:4;
      uint64_t TCSH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSHCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF0CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF1CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF2CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSTRID:4;
      uint64_t reservedSpace0:4;
      uint64_t ADATSZ:8;
      uint64_t reservedSpace1:15;
      uint64_t ALLMST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF3CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t SEQID:4;
      uint64_t reservedSpace1:1;
      uint64_t SEQID_WR_EN:1;
      uint64_t reservedSpace2:10;
      uint64_t SEQID_WR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BFGENCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SOCCFG:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOCCR;

