iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF0IND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF1IND;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t TPINDX2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BUF2IND;

  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AWTRGLVL:8;
      uint64_t reservedSpace0:6;
      uint64_t PPW_RD_DIS:1;
      uint64_t PPW_WR_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWRCR;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLV_UPD:1;
      uint64_t SLV_DLL_BYPASS:1;
      uint64_t SLV_EN:1;
      uint64_t SLAVE_AUTO_UPDT:1;
      uint64_t DLL_CDL8:1;
      uint64_t reservedSpace0:3;
      uint64_t SLV_DLY_COARSE:4;
      uint64_t SLV_DLY_OFFSET:3;
      uint64_t reservedSpace1:1;
      uint64_t SLV_FINE_OFFSET:4;
      uint64_t DLLRES:4;
      uint64_t DLL_REFCNTR:4;
      uint64_t reservedSpace2:2;
      uint64_t FREQEN:1;
      uint64_t DLLEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLLCRA;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t CRCBIN_FA:1;
      uint64_t CRCBEN_FA:1;
      uint64_t CRCEN_FA:1;
      uint64_t BYTE_SIZE_FA:1;
      uint64_t CHUNKSIZE_FA:6;
      uint64_t CRC_WNDW_FA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARITYCR;

  uint8_t res5[144];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFADR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFAR;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t FSPHS:1;
      uint64_t FSDLY:1;
      uint64_t reservedSpace1:17;
      uint64_t DLLFSMPFA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDBFL:6;
      uint64_t reservedSpace0:10;
      uint64_t RDCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WMRK:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBCT;

  uint8_t res7[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SEQAUJOIN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AWRSR;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLLA_SLV_COARSE_VAL:4;
      uint64_t DLLA_SLV_FINE_VAL:4;
      uint64_t reservedSpace0:4;
      uint64_t DLLA_FINE_UNDERFLOW:1;
      uint64_t DLLA_RANGE_ERR:1;
      uint64_t SLVA_LOCK:1;
      uint64_t DLLA_LOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLLSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:14;
      uint64_t DLP_SEL_FA:2;
      uint64_t reservedSpace1:8;
      uint64_t DL_NONDLP_FLSH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NEG_EDGE:8;
      uint64_t POS_EDGE:8;
      uint64_t reservedSpace0:15;
      uint64_t DLPFFA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLSR_FA;

  uint8_t res9[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRBFL:9;
      uint64_t reservedSpace0:7;
      uint64_t TRCTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WMRK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBCT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t IP_ACC:1;
      uint64_t AHB_ACC:1;
      uint64_t reservedSpace0:1;
      uint64_t AWRACC:1;
      uint64_t reservedSpace1:1;
      uint64_t AHBTRN:1;
      uint64_t AHB0NE:1;
      uint64_t AHB1NE:1;
      uint64_t AHB2NE:1;
      uint64_t AHB3NE:1;
      uint64_t AHB0FUL:1;
      uint64_t AHB1FUL:1;
      uint64_t AHB2FUL:1;
      uint64_t AHB3FUL:1;
      uint64_t reservedSpace2:1;
      uint64_t RXWE:1;
      uint64_t reservedSpace3:2;
      uint64_t RXFULL:1;
      uint64_t reservedSpace4:3;
      uint64_t RXDMA:1;
      uint64_t TXNE:1;
      uint64_t TXWA:1;
      uint64_t TXDMA:1;
      uint64_t TXFULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFF:1;
      uint64_t reservedSpace0:5;
      uint64_t IPIEF:1;
      uint64_t reservedSpace1:1;
      uint64_t PPWF:1;
      uint64_t reservedSpace2:1;
      uint64_t CRCAEF:1;
      uint64_t reservedSpace3:1;
      uint64_t ABOF:1;
      uint64_t AIBSEF:1;
      uint64_t AITEF:1;
      uint64_t reservedSpace4:1;
      uint64_t RBDF:1;
      uint64_t RBOF:1;
      uint64_t reservedSpace5:5;
      uint64_t ILLINE:1;
      uint64_t DLLUNLCK:1;
      uint64_t reservedSpace6:1;
      uint64_t TBUF:1;
      uint64_t TBFF:1;
      uint64_t DLLABRT:1;
      uint64_t reservedSpace7:2;
      uint64_t DLPFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFIE:1;
      uint64_t reservedSpace0:5;
      uint64_t IPIEIE:1;
      uint64_t reservedSpace1:1;
      uint64_t PPWIE:1;
      uint64_t reservedSpace2:1;
      uint64_t CRCAIE:1;
      uint64_t reservedSpace3:1;
      uint64_t ABOIE:1;
      uint64_t AIBSIE:1;
      uint64_t AITIE:1;
      uint64_t reservedSpace4:1;
      uint64_t RBDIE:1;
      uint64_t RBOIE:1;
      uint64_t reservedSpace5:3;
      uint64_t RBDDE:1;
      uint64_t reservedSpace6:1;
      uint64_t ILLINIE:1;
      uint64_t DLLULIE:1;
      uint64_t TBFDE:1;
      uint64_t TBUIE:1;
      uint64_t TBFIE:1;
      uint64_t reservedSpace7:3;
      uint64_t DLPFIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSER;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFPTRC:1;
      uint64_t reservedSpace0:7;
      uint64_t IPPTRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPTRCLR;

  uint8_t res11[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADA1:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFA1AD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t TPADA2:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SFA2AD;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLPV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLPR;

  uint8_t res13[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RBDR_31;

  uint8_t res14[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUTKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOCK:1;
      uint64_t UNLOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LCKCR;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT42;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OPRND0:8;
      uint64_t PAD0:2;
      uint64_t INSTR0:6;
      uint64_t OPRND1:8;
      uint64_t PAD1:2;
      uint64_t INSTR1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LUT43;

