iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res16[1232];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GCLCKMID:6;
      uint64_t reservedSpace0:4;
      uint64_t GCLCK:2;
      uint64_t reservedSpace1:15;
      uint64_t GVLDFRAD:1;
      uint64_t reservedSpace2:1;
      uint64_t GVLDMDAD:1;
      uint64_t reservedSpace3:1;
      uint64_t GVLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MGC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t READ_CMD0:6;
      uint64_t reservedSpace0:2;
      uint64_t READ_CMD1:6;
      uint64_t reservedSpace1:2;
      uint64_t READ_CMD2:6;
      uint64_t VLDCMD02:1;
      uint64_t reservedSpace2:1;
      uint64_t READ_CMD3:6;
      uint64_t VLDCMD03:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITE_TO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MTO;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ_MID:6;
      uint64_t REQ_TG:1;
      uint64_t reservedSpace0:1;
      uint64_t SA:1;
      uint64_t PA:1;
      uint64_t ARB_LOCK:1;
      uint64_t reservedSpace1:1;
      uint64_t FRAD:3;
      uint64_t reservedSpace2:1;
      uint64_t SEQID:4;
      uint64_t reservedSpace3:2;
      uint64_t CMD:1;
      uint64_t reservedSpace4:4;
      uint64_t TIMEOUT:1;
      uint64_t reservedSpace5:1;
      uint64_t CLR:1;
      uint64_t reservedSpace6:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSEQREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATE:2;
      uint64_t reservedSpace0:6;
      uint64_t MID:6;
      uint64_t reservedSpace1:2;
      uint64_t CMD:1;
      uint64_t ARB_LOCK:1;
      uint64_t reservedSpace2:13;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSMSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MID:6;
      uint64_t reservedSpace0:2;
      uint64_t TG0LCK:1;
      uint64_t TG1LCK:1;
      uint64_t TG0SEC:1;
      uint64_t TG1SEC:1;
      uint64_t TG0MID:1;
      uint64_t TG1MID:1;
      uint64_t MDADPROG:1;
      uint64_t FRADPROG:1;
      uint64_t reservedSpace1:13;
      uint64_t CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPSERROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRADMTCH:1;
      uint64_t FRAD0ACC:1;
      uint64_t FRAD1ACC:1;
      uint64_t FRAD2ACC:1;
      uint64_t FRAD3ACC:1;
      uint64_t FRAD4ACC:1;
      uint64_t FRAD5ACC:1;
      uint64_t FRAD6ACC:1;
      uint64_t FRAD7ACC:1;
      uint64_t IPS_ERR:1;
      uint64_t TG0SFAR:1;
      uint64_t TG1SFAR:1;
      uint64_t TG0IPCR:1;
      uint64_t TG1IPCR:1;
      uint64_t TO_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRADMTCH:1;
      uint64_t FRAD0ACC:1;
      uint64_t FRAD1ACC:1;
      uint64_t FRAD2ACC:1;
      uint64_t FRAD3ACC:1;
      uint64_t FRAD4ACC:1;
      uint64_t FRAD5ACC:1;
      uint64_t FRAD6ACC:1;
      uint64_t FRAD7ACC:1;
      uint64_t IPS_ERR:1;
      uint64_t TG0SFAR:1;
      uint64_t TG1SFAR:1;
      uint64_t TG0IPCR:1;
      uint64_t TG1IPCR:1;
      uint64_t TO_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_EN;

};

#define QUADSPI (*(volatile struct QUADSPI_tag *) 0x404cc000)

struct QUADSPI_FRAD_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t STARTADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ENDADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD0ACP:3;
      uint64_t MD1ACP:3;
      uint64_t reservedSpace0:18;
      uint64_t EALO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t EAL:2;
      uint64_t reservedSpace1:3;
      uint64_t LOCK:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_MDID:6;
      uint64_t CMP_SA:1;
      uint64_t CMP_PA:1;
      uint64_t reservedSpace0:21;
      uint64_t CMP_ERR:1;
      uint64_t CMPVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD5;

};

#define QUADSPI_FRAD_0 (*(volatile struct QUADSPI_FRAD_0_tag *) 0x404cc800)

struct QUADSPI_FRAD_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t STARTADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ENDADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD0ACP:3;
      uint64_t MD1ACP:3;
      uint64_t reservedSpace0:18;
      uint64_t EALO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t EAL:2;
      uint64_t reservedSpace1:3;
      uint64_t LOCK:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_MDID:6;
      uint64_t CMP_SA:1;
      uint64_t CMP_PA:1;
      uint64_t reservedSpace0:21;
      uint64_t CMP_ERR:1;
      uint64_t CMPVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD5;

