iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define QUADSPI_FRAD_1 (*(volatile struct QUADSPI_FRAD_1_tag *) 0x404cc820)

struct QUADSPI_FRAD_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t STARTADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ENDADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD0ACP:3;
      uint64_t MD1ACP:3;
      uint64_t reservedSpace0:18;
      uint64_t EALO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t EAL:2;
      uint64_t reservedSpace1:3;
      uint64_t LOCK:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_MDID:6;
      uint64_t CMP_SA:1;
      uint64_t CMP_PA:1;
      uint64_t reservedSpace0:21;
      uint64_t CMP_ERR:1;
      uint64_t CMPVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD5;

};

#define QUADSPI_FRAD_2 (*(volatile struct QUADSPI_FRAD_2_tag *) 0x404cc840)

struct QUADSPI_FRAD_3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t STARTADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ENDADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD0ACP:3;
      uint64_t MD1ACP:3;
      uint64_t reservedSpace0:18;
      uint64_t EALO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t EAL:2;
      uint64_t reservedSpace1:3;
      uint64_t LOCK:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_MDID:6;
      uint64_t CMP_SA:1;
      uint64_t CMP_PA:1;
      uint64_t reservedSpace0:21;
      uint64_t CMP_ERR:1;
      uint64_t CMPVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD5;

};

#define QUADSPI_FRAD_3 (*(volatile struct QUADSPI_FRAD_3_tag *) 0x404cc860)

struct QUADSPI_FRAD_4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t STARTADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ENDADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD0ACP:3;
      uint64_t MD1ACP:3;
      uint64_t reservedSpace0:18;
      uint64_t EALO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t EAL:2;
      uint64_t reservedSpace1:3;
      uint64_t LOCK:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_MDID:6;
      uint64_t CMP_SA:1;
      uint64_t CMP_PA:1;
      uint64_t reservedSpace0:21;
      uint64_t CMP_ERR:1;
      uint64_t CMPVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD5;

};

#define QUADSPI_FRAD_4 (*(volatile struct QUADSPI_FRAD_4_tag *) 0x404cc880)

struct QUADSPI_FRAD_5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t STARTADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ENDADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD0ACP:3;
      uint64_t MD1ACP:3;
      uint64_t reservedSpace0:18;
      uint64_t EALO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t EAL:2;
      uint64_t reservedSpace1:3;
      uint64_t LOCK:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_MDID:6;
      uint64_t CMP_SA:1;
      uint64_t CMP_PA:1;
      uint64_t reservedSpace0:21;
      uint64_t CMP_ERR:1;
      uint64_t CMPVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD5;

};

#define QUADSPI_FRAD_5 (*(volatile struct QUADSPI_FRAD_5_tag *) 0x404cc8a0)

struct QUADSPI_FRAD_6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t STARTADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ENDADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD0ACP:3;
      uint64_t MD1ACP:3;
      uint64_t reservedSpace0:18;
      uint64_t EALO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t EAL:2;
      uint64_t reservedSpace1:3;
      uint64_t LOCK:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_MDID:6;
      uint64_t CMP_SA:1;
      uint64_t CMP_PA:1;
      uint64_t reservedSpace0:21;
      uint64_t CMP_ERR:1;
      uint64_t CMPVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD5;

