iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define QUADSPI_FRAD_6 (*(volatile struct QUADSPI_FRAD_6_tag *) 0x404cc8c0)

struct QUADSPI_FRAD_7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t STARTADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t ENDADR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MD0ACP:3;
      uint64_t MD1ACP:3;
      uint64_t reservedSpace0:18;
      uint64_t EALO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t EAL:2;
      uint64_t reservedSpace1:3;
      uint64_t LOCK:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_MDID:6;
      uint64_t CMP_SA:1;
      uint64_t CMP_PA:1;
      uint64_t reservedSpace0:21;
      uint64_t CMP_ERR:1;
      uint64_t CMPVALID:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRAD_WORD5;

};

#define QUADSPI_FRAD_7 (*(volatile struct QUADSPI_FRAD_7_tag *) 0x404cc8e0)

struct QUADSPI_MDAD_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDMATCH:6;
      uint64_t MASK:6;
      uint64_t MASKTYPE:1;
      uint64_t reservedSpace0:1;
      uint64_t SA:2;
      uint64_t reservedSpace1:13;
      uint64_t LCK:1;
      uint64_t reservedSpace2:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGMDAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFARADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGSFAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TG_MID:6;
      uint64_t reservedSpace0:4;
      uint64_t SA:1;
      uint64_t reservedSpace1:1;
      uint64_t PA:1;
      uint64_t reservedSpace2:16;
      uint64_t CLR:1;
      uint64_t ERR:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGSFARS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATSZ:16;
      uint64_t SEQID:4;
      uint64_t PAR:1;
      uint64_t ARB_LOCK:1;
      uint64_t ARB_UNLOCK:1;
      uint64_t reservedSpace0:5;
      uint64_t CLR:1;
      uint64_t ERR:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGIPCRS;

};

#define QUADSPI_MDAD_0 (*(volatile struct QUADSPI_MDAD_0_tag *) 0x404cc900)

struct QUADSPI_MDAD_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MIDMATCH:6;
      uint64_t MASK:6;
      uint64_t MASKTYPE:1;
      uint64_t reservedSpace0:1;
      uint64_t SA:2;
      uint64_t reservedSpace1:13;
      uint64_t LCK:1;
      uint64_t reservedSpace2:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGMDAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFARADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGSFAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TG_MID:6;
      uint64_t reservedSpace0:4;
      uint64_t SA:1;
      uint64_t reservedSpace1:1;
      uint64_t PA:1;
      uint64_t reservedSpace2:16;
      uint64_t CLR:1;
      uint64_t ERR:1;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGSFARS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDATSZ:16;
      uint64_t SEQID:4;
      uint64_t PAR:1;
      uint64_t ARB_LOCK:1;
      uint64_t ARB_UNLOCK:1;
      uint64_t reservedSpace0:5;
      uint64_t CLR:1;
      uint64_t ERR:2;
      uint64_t VLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TGIPCRS;

};

#define QUADSPI_MDAD_1 (*(volatile struct QUADSPI_MDAD_1_tag *) 0x404cc910)

struct SAI_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEATURE:16;
      uint64_t MINOR:8;
      uint64_t MAJOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATALINE:4;
      uint64_t reservedSpace0:4;
      uint64_t FIFO:4;
      uint64_t reservedSpace1:4;
      uint64_t FRAME:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PARAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t reservedSpace0:6;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t reservedSpace2:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t reservedSpace3:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t reservedSpace4:1;
      uint64_t TE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TFW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:15;
      uint64_t BYP:1;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:4;
      uint64_t reservedSpace0:12;
      uint64_t TCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t ONDEM:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t CHMOD:1;
      uint64_t reservedSpace0:2;
      uint64_t SYWD:5;
      uint64_t reservedSpace1:3;
      uint64_t FRSZ:4;
      uint64_t reservedSpace2:4;
      uint64_t FPACK:2;
      uint64_t reservedSpace3:2;
      uint64_t FCONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FBT:5;
      uint64_t reservedSpace1:3;
      uint64_t W0W:5;
      uint64_t reservedSpace2:3;
      uint64_t WNW:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDR0;

  uint8_t res0[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TFR0;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TMR;

  uint8_t res2[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRDE:1;
      uint64_t FWDE:1;
      uint64_t reservedSpace0:6;
      uint64_t FRIE:1;
      uint64_t FWIE:1;
      uint64_t FEIE:1;
      uint64_t SEIE:1;
      uint64_t WSIE:1;
      uint64_t reservedSpace1:3;
      uint64_t FRF:1;
      uint64_t FWF:1;
      uint64_t FEF:1;
      uint64_t SEF:1;
      uint64_t WSF:1;
      uint64_t reservedSpace2:3;
      uint64_t SR:1;
      uint64_t FR:1;
      uint64_t reservedSpace3:2;
      uint64_t BCE:1;
      uint64_t DBGE:1;
      uint64_t reservedSpace4:1;
      uint64_t RE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIV:8;
      uint64_t reservedSpace0:15;
      uint64_t BYP:1;
      uint64_t BCD:1;
      uint64_t BCP:1;
      uint64_t MSEL:2;
      uint64_t BCI:1;
      uint64_t reservedSpace1:1;
      uint64_t SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDFL:4;
      uint64_t reservedSpace0:12;
      uint64_t RCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSD:1;
      uint64_t FSP:1;
      uint64_t ONDEM:1;
      uint64_t FSE:1;
      uint64_t MF:1;
      uint64_t reservedSpace0:3;
      uint64_t SYWD:5;
      uint64_t reservedSpace1:3;
      uint64_t FRSZ:4;
      uint64_t reservedSpace2:4;
      uint64_t FPACK:2;
      uint64_t reservedSpace3:2;
      uint64_t FCONT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t FBT:5;
      uint64_t reservedSpace1:3;
      uint64_t W0W:5;
      uint64_t reservedSpace2:3;
      uint64_t WNW:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RDR0;

  uint8_t res3[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFP:4;
      uint64_t reservedSpace0:12;
      uint64_t WFP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFR0;

  uint8_t res4[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMR;

