iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FEVTAC12NE:1;
      uint64_t FEVTAC12TOE:1;
      uint64_t FEVTAC12CE:1;
      uint64_t FEVTAC12EBE:1;
      uint64_t FEVTAC12IE:1;
      uint64_t reservedSpace0:2;
      uint64_t FEVTCNIBAC12E:1;
      uint64_t reservedSpace1:8;
      uint64_t FEVTCTOE:1;
      uint64_t FEVTCCE:1;
      uint64_t FEVTCEBE:1;
      uint64_t FEVTCIE:1;
      uint64_t FEVTDTOE:1;
      uint64_t FEVTDCE:1;
      uint64_t FEVTDEBE:1;
      uint64_t reservedSpace2:1;
      uint64_t FEVTAC12E:1;
      uint64_t reservedSpace3:1;
      uint64_t FEVTTNE:1;
      uint64_t reservedSpace4:1;
      uint64_t FEVTDMAE:1;
      uint64_t reservedSpace5:2;
      uint64_t FEVTCINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FORCE_EVENT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADMAES:2;
      uint64_t ADMALME:1;
      uint64_t ADMADCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMA_ERR_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t ADS_ADDR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADMA_SYS_ADDR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLL_CTRL_ENABLE:1;
      uint64_t DLL_CTRL_RESET:1;
      uint64_t DLL_CTRL_SLV_FORCE_UPD:1;
      uint64_t DLL_CTRL_SLV_DLY_TARGET0:4;
      uint64_t DLL_CTRL_GATE_UPDATE:1;
      uint64_t DLL_CTRL_SLV_OVERRIDE:1;
      uint64_t DLL_CTRL_SLV_OVERRIDE_VAL:7;
      uint64_t DLL_CTRL_SLV_DLY_TARGET1:3;
      uint64_t reservedSpace0:1;
      uint64_t DLL_CTRL_SLV_UPDATE_INT:8;
      uint64_t DLL_CTRL_REF_UPDATE_INT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLL_CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLL_STS_SLV_LOCK:1;
      uint64_t DLL_STS_REF_LOCK:1;
      uint64_t DLL_STS_SLV_SEL:7;
      uint64_t DLL_STS_REF_SEL:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLL_STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLY_CELL_SET_POST:4;
      uint64_t DLY_CELL_SET_OUT:4;
      uint64_t DLY_CELL_SET_PRE:7;
      uint64_t NXT_ERR:1;
      uint64_t TAP_SEL_POST:4;
      uint64_t TAP_SEL_OUT:4;
      uint64_t TAP_SEL_PRE:7;
      uint64_t PRE_ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK_TUNE_CTRL_STATUS;

  uint8_t res2[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXT_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t CONFLICT_CHK_EN:1;
      uint64_t AC12_WR_CHKBUSY_EN:1;
      uint64_t reservedSpace1:4;
      uint64_t FRC_SDCLK_ON:1;
      uint64_t reservedSpace2:6;
      uint64_t CRC_CHK_DIS:1;
      uint64_t reservedSpace3:15;
      uint64_t CMD_BYTE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VEND_SPEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DTOCV_ACK:4;
      uint64_t BOOT_ACK:1;
      uint64_t BOOT_MODE:1;
      uint64_t BOOT_EN:1;
      uint64_t AUTO_SABG_EN:1;
      uint64_t DISABLE_TIME_OUT:1;
      uint64_t reservedSpace0:7;
      uint64_t BOOT_BLK_CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MMC_BOOT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t CARD_INT_D3_TEST:1;
      uint64_t TUNING_8bit_EN:1;
      uint64_t TUNING_1bit_EN:1;
      uint64_t TUNING_CMD_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VEND_SPEC2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TUNING_START_TAP:7;
      uint64_t DIS_CMD_CHK_FOR_STD_TUNING:1;
      uint64_t TUNING_COUNTER:8;
      uint64_t TUNING_STEP:3;
      uint64_t reservedSpace0:1;
      uint64_t TUNING_WINDOW:3;
      uint64_t reservedSpace1:1;
      uint64_t STD_TUNING_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TUNING_CTRL;

};

#define USDHC (*(volatile struct USDHC_tag *) 0x404e4000)

struct QUADSPI_ARDB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ARXD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ARDB_31;

