iSYSTEMLabs/winIDEAExampleWorkspaces/NXP/S32K358_FLASH_GCC/targetInit/S32K358_sfr.h
};

#define QUADSPI_ARDB (*(volatile struct QUADSPI_ARDB_tag *) 0x68000000)

struct MCM_0_CM7_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLREV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLREV;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PCT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:27;
      uint64_t CM7_AHBSPRI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t WABS:1;
      uint64_t WABSO:1;
      uint64_t reservedSpace1:1;
      uint64_t FIOC:1;
      uint64_t FDZC:1;
      uint64_t FOFC:1;
      uint64_t FUFC:1;
      uint64_t FIXC:1;
      uint64_t reservedSpace2:2;
      uint64_t FIDC:1;
      uint64_t reservedSpace3:5;
      uint64_t WABE:1;
      uint64_t reservedSpace4:2;
      uint64_t FIOCE:1;
      uint64_t FDZCE:1;
      uint64_t FOFCE:1;
      uint64_t FUFCE:1;
      uint64_t FIXCE:1;
      uint64_t reservedSpace5:2;
      uint64_t FIDCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISCR;

  uint8_t res1[1004];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_4;

};

#define MCM_0_CM7 (*(volatile struct MCM_0_CM7_tag *) 0xe0080000)

struct MCM_1_CM7_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLREV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLREV;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PCT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCT;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:27;
      uint64_t CM7_AHBSPRI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t WABS:1;
      uint64_t WABSO:1;
      uint64_t reservedSpace1:1;
      uint64_t FIOC:1;
      uint64_t FDZC:1;
      uint64_t FOFC:1;
      uint64_t FUFC:1;
      uint64_t FIXC:1;
      uint64_t reservedSpace2:2;
      uint64_t FIDC:1;
      uint64_t reservedSpace3:5;
      uint64_t WABE:1;
      uint64_t reservedSpace4:2;
      uint64_t FIOCE:1;
      uint64_t FDZCE:1;
      uint64_t FOFCE:1;
      uint64_t FUFCE:1;
      uint64_t FIXCE:1;
      uint64_t reservedSpace5:2;
      uint64_t FIDCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISCR;

  uint8_t res1[1004];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:13;
      uint64_t MT:3;
      uint64_t reservedSpace1:1;
      uint64_t DPW:3;
      uint64_t WY:4;
      uint64_t LMSZ:4;
      uint64_t LMSZH:1;
      uint64_t reservedSpace2:2;
      uint64_t LMV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LMEM_DESC_4;

